[
    {
        "title": "band-assisted-bench-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Attach the resistance band under the bench, loop it around the barbell, and back under the bench.",
            "Lie on the bench with feet flat, back slightly arched, and shoulder blades retracted.",
            "Grip the barbell at your preferred width.",
            "Unrack the barbell and position it above your chest.",
            "Lower the barbell to your chest, keeping tension in your upper body.",
            "Press the barbell back up to the starting position against the band.",
            "Repeat for reps."
        ],
        "comments": "The bench press against bands is a variation of the bench press in which resistance bands increase the tension as you press up. This makes it more challenging to lock out the lift, enhancing strength and power. It’s typically used to improve explosive strength and stability. Make sure to use the safety racks or to have a spotter while performing this exercise."
    },
    {
        "title": "bar-dip",
        "primary_muscles": [
            "Chest",
            "Front Deltoid",
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grip a dip station about shoulder-width apart, and climb or jump to get into the starting position.",
            "Lower yourself with control until your shoulder is below your elbow, or as deep as you comfortably can.",
            "Reverse the motion and return to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "bench-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Lie on the bench, pull your shoulder blades together and down, and slightly arch your back.",
            "Grip the bar slightly wider than shoulder-width apart.",
            "Inhale, hold your breath, and unrack the bar.",
            "Lower the bar with control, until it touches your chest somewhere close to your sternum.",
            "Push the bar up to the starting position while exhaling.",
            "Take another breath while in the top position, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "bench-press-against-band",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Attach the resistance band under the bench, loop it around the barbell, and back under the bench.",
            "Lie on the bench with feet flat, back slightly arched, and shoulder blades retracted.",
            "Grip the barbell at your preferred width.",
            "Unrack the barbell and position it above your chest.",
            "Lower the barbell to your chest, keeping tension in your upper body.",
            "Press the barbell back up to the starting position against the band.",
            "Repeat for reps."
        ],
        "comments": "The bench press against bands is a variation of the bench press in which resistance bands increase the tension as you press up. This makes it more challenging to lock out the lift, enhancing strength and power. It’s typically used to improve explosive strength and stability. Make sure to use the safety racks or to have a spotter while performing this exercise."
    },
    {
        "title": "board-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Lie on a bench and have a partner place a board on your chest. Alternatively, secure it with a band on the barbell.",
            "Grip the barbell at your desired width and unrack the weight.",
            "Lower the bar until it touches the board, and make sure to keep the tension in your upper body to maintain position.",
            "Press the barbell back up to the starting position in a controlled, explosive movement."
        ],
        "comments": "The board press is a variation of the bench press where you place a board on your chest to limit the range of motion. This makes it easier to move heavier weights since the range of motion gets shortened. It’s typically used for improving lockout strength."
    },
    {
        "title": "cable-chest-press",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Front Deltoid",
            "Triceps"
        ],
        "instructions": [
            "Fasten a pair of handles in the top position of a cable cross. Grip the handles, step forward, and lean slightly forward.",
            "Push the handles forward until they meet in front of your body.",
            "With control, let the handles go back to the starting position."
        ],
        "comments": "Cable chest press is a pressing exercise with a different resistance curve than for example dumbbell chest press, as the direction of resistance comes more from the sides. That might make it easier to keep tension on the chest muscles throughout the whole movement, and thus possibly benefit muscle growth."
    },
    {
        "title": "close-grip-bench-press",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "instructions": [
            "Lie on the bench, pull your shoulder blades together and down, and slightly arch your back.",
            "Grip the bar narrower than in a regular bench press so that your hands are directly above your shoulders or even closer.",
            "Take a breath and hold it, and unrack the bar.",
            "Lower the bar with control until it touches your chest somewhere where the ribs end.",
            "Push the bar up to the starting position while exhaling.",
            "Take another breath in the top position, and repeat for reps."
        ],
        "comments": "The close-grip bench press is a variant of the bench press where you transfer more of the work to the triceps, and away from the chest and front deltoid. This means that most people will have to use less weight in the close-grip bench press than in the regular bench press."
    },
    {
        "title": "close-grip-feet-up-bench-press",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "instructions": [
            "Lie on the bench, pull your shoulderblades together and down, and raise your chest up.",
            "Grip the bar narrower than in a regular bench press, so that your hands are directly above your shoulders or even closer.",
            "Lift your feet up and hold them in the air.",
            "Take a breath and hold it, and unrack the bar.",
            "Lower the bar with control, until it touches your chest somewhere where the ribs end.",
            "Take another breath in the top position, and repeat for reps."
        ],
        "comments": "Close-grip bench press is a variant of the bench press where you transfer more of the work to the triceps, and away from the chest and front deltoid. This means that most people will have to use less weight in the close-grip bench press than in the regular bench press. Many use close-grip bench press as an assitance lift for the bench press in order to strengthen their triceps. For certain shoulder issues, the close-grip bench press might serve as a viable substitute for regular bench presses."
    },
    {
        "title": "decline-bench-press",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Triceps",
            "Front Deltoid"
        ],
        "instructions": [
            "Set a bench so that it is in decline, either by adjusting the backrest or by elevating the foot.",
            "Lie down on the bench, pull your shoulder blades together and down, with a proud chest.",
            "Grip the bar slightly wider than shoulder-width apart.",
            "Take a breath and hold it, and unrack the bar.",
            "Lower the bar with control until it touches your chest.",
            "Push the bar up while exhaling.",
            "Take another breath in the top position, and repeat for reps."
        ],
        "comments": "The decline bench press is a bench press variation that shifts more of the load to your lower chest muscle fibers. Remember to set up safety racks on your sides while decline benching, as you cannot roll the bar down your belly if you fail."
    },
    {
        "title": "decline-push-up",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Abs"
        ],
        "instructions": [
            "Assume the starting position, with hands slightly wider than shoulder-width apart and your feet on a small elevation.",
            "Try to form a straight line from head to feet, and brace your abdomen slightly.",
            "Lower yourself as deep as you can, while inhaling.",
            "Reverse the motion, and push yourself up to straight arms again while exhaling.",
            "Repeat for reps."
        ],
        "comments": "The push-up is a classic bodyweight exercise for the upper body, with the benefit that you don’t need any equipment to perform it. In push-ups, you lift about 70% of your own body weight, but you can increase or decrease that amount by placing your feet or hands, respectively, on an elevation. This version of the push-up increases the load since your feet are elevated to a sofa, chair, bench, weight plates, or whatever you are using."
    },
    {
        "title": "dumbbell-chest-fly",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Lie on a bench, and lift a pair of dumbbells up to the starting position.",
            "With almost completely straight arms, lower the dumbbells out to your sides.",
            "When you’ve lowered the dumbbells as deep as possible, reverse the motion and return the dumbbells to the starting position.",
            "Repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-chest-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Lie on a bench, and lift a pair of dumbbells up to the starting position.",
            "Press the dumbbells up to straight arms, while exhaling.",
            "Inhale at the top, or while lowering the dumbbells with control back to your shoulders.",
            "Repeat for reps."
        ],
        "comments": "The dumbbell chest press is a pressing exercise similar to the barbell bench press, except that it is performed with dumbbells. Using dumbbells decreases the stability compared to using a barbell, which increases the demands on stabilization from your shoulder musculature, and it might also decrease the total amount of weight you are able to lift. In return, many experience that they can lift in a better position and with a better range of motion when they use dumbbells instead of a bar."
    },
    {
        "title": "dumbbell-decline-chest-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Set a bench so that it is in decline, either by adjusting the backrest or by elevating the foot.",
            "Lie on a bench, and lift a pair of dumbbells to the starting position.",
            "Press the dumbbells up to straight arms, while exhaling.",
            "Inhale at the top, or while lowering the dumbbells with control back to your shoulders.",
            "Repeat for reps."
        ],
        "comments": "Decline dumbbell press is a dumbbell press variation that shifts more of the load to your lower chest muscle fibers. Using dumbbells decreases the stability compared to using a barbell, which increases the demands on stabilization from your shoulder musculature, and it might also decrease the total amount of weight you are able to lift. In return, many experience that they can lift in a better position and with a better range of motion when they use dumbbells instead of a bar."
    },
    {
        "title": "dumbbell-floor-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Sit on the floor with your legs straight and a pair of dumbbells beside you.",
            "Pick the dumbbells up and place them in your hip creak.",
            "Lay down while you bring the dumbbells up to your chest.",
            "Press them dumbbells to straight arms, bend your knees, and place your feet flat on the floor.",
            "Lower the dumbbells slowly until your upper arms hit the floor.",
            "Reverse the motion and push the dumbbells up to straight arms again.",
            "Gently drop the dumbbells to the floor to finish the set."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-pullover",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Lats"
        ],
        "instructions": [
            "Lie down on a bench and lift a dumbbell up to almost straight arms above you.",
            "Lower the dumbbell down behind your head, while keeping your arms almost completely straight, just with a slight bend in the elbows.",
            "Reverse the motion and return the dumbbell to the starting position."
        ],
        "comments": "Pullover is an exercise that can be used to train both the chest and/or lat muscles, depending on how you perform the exercise. Focus on contact in the muscle you want to train, and prioritize form over load. A dumbbell or a small barbell are good options for resistance."
    },
    {
        "title": "feet-up-bench-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Lie on the bench, pull your shoulder blades together and down, and slightly arch your back.",
            "Grip the bar slightly wider than shoulder-width apart.",
            "Lift your feet up and hold them in the air.",
            "Take a breath and hold it, and unrack the bar.",
            "Lower the bar with control, until it touches your chest somewhere close to the sternum.",
            "Push the bar up while exhaling.",
            "Take another breath in the top position, and repeat for reps."
        ],
        "comments": "The feet-up bench press is a variant of the bench press. By raising your feet you will get to practice creating stability in your upper body instead, and you will generally also have less of an arch, which might contribute to a longer range of motion."
    },
    {
        "title": "floor-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Lie down on the floor with your eyes under the racked bar.",
            "Grip the bar slightly wider than shoulder-width apart.",
            "Inhale, pull your shoulder blades down and together, and unrack the bar.",
            "Lower the bar slowly until your upper arms hit the floor.",
            "Reverse the motion and push the bar up to straight arms again."
        ],
        "comments": "The floor press is a variant of the bench press where you lie on the floor instead of a bench, which limits the range of motion since your upper arms will stop against the floor. This can help you overload the top portion of the bench press movement."
    },
    {
        "title": "incline-bench-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Sitting on an inclined bench, unrack a barbell and hold it on straight arms above your shoulders.",
            "Inhale and lower the bar down to your chest.",
            "Press the bar up to straight arms while exhaling."
        ],
        "comments": "The incline bench press is a mixture of the regular bench press and the overhead press, and both the front deltoids and the upper portions of the chest muscles are trained in this exercise. Thanks to the bench’s inclination, many experience this exercise as easy on their shoulders and that they can get a nice, long range of motion."
    },
    {
        "title": "dumbbell-incline-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Adjust the incline of a bench to be around 30-45 degrees.",
            "Sit down and lift a pair of dumbbells to the starting position.",
            "Press the dumbbells up to straight arms while exhaling.",
            "Inhale at the top or while lowering the dumbbells with control back to your shoulders."
        ],
        "comments": ""
    },
    {
        "title": "incline-push-up",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Abs"
        ],
        "instructions": [
            "Assume the starting position, with hands slightly wider than shoulder width apart.",
            "Try to form a straight line from head to feet, and brace your abdomen slightly.",
            "Lower yourself as deep as you can, while inhaling.",
            "Reverse the motion when you’ve touched the elevation, and push yourself up to straight arms again while exhaling.",
            "Repeat for reps."
        ],
        "comments": "The push-up is a classic bodyweight exercise for the upper body, with the benefit that you don’t need any equipment to perform it. In push-ups, you lift about 70% of your own body weight, but you can increase or decrease that amount by placing your feet or hands, respectively, on an elevation. This version of the push-up decreases the load since your hands are elevated to the sofa, chair, bench or whatever you are using."
    },
    {
        "title": "kettlebell-floor-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Sit on the floor with your legs straight and a pair of kettlebells beside you.",
            "Pick the kettlebells up and place them in your hip creak.",
            "Lay down while you bring the kettlebells up to your chest.",
            "Press to straight arms, bend your knees, and place your feet flat on the floor.",
            "Lower the kettlebells slowly until your upper arms hit the floor.",
            "Reverse the motion and push the kettlebells up to straight arms again.",
            "Gently drop the kettlebells to the floor to finish the set."
        ],
        "comments": ""
    },
    {
        "title": "kneeling-incline-push-up",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Abs"
        ],
        "instructions": [
            "Assume the starting position on your knees, with your hands on an elevation (such as a step-board), slightly wider than shoulder width apart.",
            "Try to form a straight line from head to knee, and brace your abdomen slightly.",
            "Lower yourself as deep as you can, while inhaling.",
            "Reverse the motion when you’ve touched the board, and push yourself up to straight arms again while exhaling.",
            "Repeat for reps."
        ],
        "comments": "Incline push-ups on your knees is an easier variant of push-ups, which you can use to build up your strength before you move on to more advanced variants. Suitable next steps after this exercise are kneeling push-ups on flat ground, or incline push-ups standing on your feet."
    },
    {
        "title": "kneeling-push-up",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Abs"
        ],
        "instructions": [
            "Assume the starting position, with hands slightly wider than shoulder width apart.",
            "Try to form a straight line from head to knees, and brace your abdomen slightly.",
            "Lower yourself as deep as you can, while inhaling.",
            "Reverse the motion when you’ve touched the floor, and push yourself up to straight arms again while exhaling.",
            "Repeat for reps."
        ],
        "comments": "This is an easier version of the classic push-up. In regular push-ups on your feet, you lift about 70% of your own body weight, but in kneeling push-ups, you only lift about 55% of your body weight. Therefore, this exercise variation can serve as a useful training tool to increase your strength until you can do regular push-ups."
    },
    {
        "title": "machine-chest-fly",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Adjust the back support and handles so that you can grip the handles at shoulder height and get a long range of motion.",
            "With just a slight bend in the arms, push the handles forward until they meet in front of your body.",
            "With control, let the handles go back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "machine-chest-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Adjust the machine to the appropriate settings, sit down, and grip the handles.",
            "Press the handles forward until your arms are straight.",
            "Bring the handles back to the starting position with control."
        ],
        "comments": "The machine chest press is an exercise that offers more stability, and requires less balance and coordination than chest presses with for example dumbbells or a barbell. That could lead to increased focus on the muscles worked, and also makes it easy to learn for a beginner."
    },
    {
        "title": "pec-deck",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Adjust the the back support and handles, so that you can lean your elbows against the pads while your upper arms are horizontal.",
            "Push the pads forward until they meet in front of your body.",
            "With control, let the pads go back to the starting position."
        ],
        "comments": "Pec deck is an isolation exercise for the chest and front deltoids, where you have an even and constant load on your chest muscles throughout the whole range of motion."
    },
    {
        "title": "pin-bench-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Place a bench in a power rack (or use a combo rack with safety bars). Adjust the safety pins to a height so that the bar will end up just above your chest when lying down in your usual bench press position.",
            "Lie on the bench, pull your shoulder blades together and down, and slightly arch your back.",
            "Grip the bar slightly wider than shoulder-width apart.",
            "Inhale, hold your breath, and unrack the bar.",
            "Lower the bar with control until it touches the safetys.",
            "Push the bar up while exhaling.",
            "Take another breath in the top position, and repeat for reps."
        ],
        "comments": "The pin press can be effective for improving lockout strength and keeping tightness in your arching in the bench press. Remember to keep the tension in your body the entire movement, even in the bottom position."
    },
    {
        "title": "push-up",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Abs"
        ],
        "instructions": [
            "Assume the starting position, with hands slightly wider than shoulder-width apart.",
            "Try to form a straight line from head to feet, and brace your abdomen slightly.",
            "Lower yourself as deep as you can, while inhaling.",
            "Reverse the motion when you’ve touched the floor, and push yourself up to straight arms again while exhaling.",
            "Repeat for reps."
        ],
        "comments": "The push-up is a classic bodyweight exercise for the upper body, with the benefit that you don’t need any equipment to perform it. In push-ups, you lift about 70% of your own body weight, but you can increase or decrease that amount by placing your feet or hands, respectively, on an elevation. In kneeling push-ups, you lift about 55% of your body weight."
    },
    {
        "title": "push-up-against-wall",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Abs"
        ],
        "instructions": [
            "Assume the starting position, with hands slightly wider than shoulder width apart.",
            "Try to form a straight line from head to feet, and brace your abdomen slightly.",
            "Lower yourself as deep as you can, while inhaling.",
            "Reverse the motion when you’ve touched the wall, and push yourself up to straight arms again while exhaling.",
            "Repeat for reps."
        ],
        "comments": "The push-up is a classic body weight exercise for the upper body, with the benefit that you don’t need any equipment to perform it. In push-ups, you lift about 70% of your own body weight, but you can increase or decrease that amount by placing your feet or hands, respectively, on an elevation. This version of the push-up decreases the load since your hands are elevated to the wall."
    },
    {
        "title": "push-ups-with-feet-in-rings",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Abs"
        ],
        "instructions": [
            "Assume the starting position, with hands slightly wider than shoulder-width apart.",
            "Place your feet in the rings. Try to form a straight line from head to feet, and brace your core slightly.",
            "Lower yourself as deep as you can, while inhaling.",
            "Reverse the motion, and push yourself up to straight arms again while exhaling.",
            "Repeat for reps"
        ],
        "comments": "The pushup is a classic bodyweight exercise for the upper body, with the benefit that you don’t need any equipment to perform it. In push-ups, you lift about 70% of your own body weight, but you can increase or decrease that load by placing your hands or feet, respectively, on an elevation. This version of a push-up increases the load since your feet are elevated, and it also challenges your core and balance due to the instability."
    },
    {
        "title": "resistance-band-chest-fly",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Attach the band to a door or something similarly stable around chest level.",
            "In a standing position, grab the band with one hand and move away from the anchor point until you feel a stretch and resistance in your chest muscles.",
            "Pull the band in front of your body at chest height with a slight bend at the elbow.",
            "Contract your chest muscle before returning to the starting position with a controlled movement and repeat for reps.",
            "Switch to the other side of your body and perform the above steps again."
        ],
        "comments": ""
    },
    {
        "title": "smith-machine-bench-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Lie on the bench, pull your shoulderblades together and down, and hold your chest up.",
            "Grip the bar slightly wider than shoulder-width apart.",
            "Take a breath and hold it, and unrack the bar.",
            "Lower the bar with control, until it touches your chest.",
            "Push the bar up while exhaling.",
            "Take another breath in the top position, and repeat for reps."
        ],
        "comments": "Smith bench press differs from barbell bench press primarily by its completely straight bar path, instead of a slightly arched one. The exercise also has lower requirements for stabilization and balance, which could make it easier to focus on the muscles trained."
    },
    {
        "title": "smith-machine-incline-bench-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Sit on an inclined bench, pull your shoulderblades together and down, and hold your chest up.",
            "Grip the bar slightly wider than shoulder-width apart.",
            "Take a breath and hold it, and unrack the bar.",
            "Lower the bar with control, until it touches your upper chest.",
            "Push the bar up while exhaling.",
            "Take another breath in the top position, and repeat for reps."
        ],
        "comments": "Smith incline bench press differs from incline barbell bench press primarily by its completely straight bar path, instead of a slightly arched one. The exercise also has lower requirements for stabilization and balance, which could make it easier to focus on the muscles trained."
    },
    {
        "title": "standing-cable-chest-fly",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Fasten a pair of handles in the top position of a cable cross. Grip the handles, step forward, and lean slightly forward.",
            "With just a slight bend in the arms, push the handles forward until they meet in front of your body.",
            "With control, let the handles go back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "standing-resistance-band-chest-fly",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Attach the band to a door or something similarly stable around chest level.",
            "In a standing position, grab the band with one hand and move away from the anchor point until you feel a stretch and resistance in your chest muscles.",
            "Pull the band in front of your body at chest height with a slight bend at the elbow.",
            "Contract your chest muscle before returning to the starting position with a controlled movement and repeat for reps.",
            "Switch to the other side of your body and perform the above steps again."
        ],
        "comments": ""
    },
    {
        "title": "band-external-shoulder-rotation",
        "primary_muscles": [
            "Rotator Cuff (posterior)"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Fasten an elastic band at elbow height. Grab the band, step away and stand sideways to the band.",
            "Grab the band with your arm that is on the opposite side from the band’s attachment point. Keep your upper arm close to your side, and bend your elbow to 90 degrees.",
            "Rotate your upper arm externally (outwards) against the resistance of the band, as far as possible.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": "External rotations against an elastic band train your posterior rotator cuff muscles, mainly infraspinatus."
    },
    {
        "title": "band-internal-shoulder-rotation",
        "primary_muscles": [
            "Rotator Cuff (anterior)"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Fasten an elastic band at elbow height. Grab the band, step away and stand sideways to the band.",
            "Grab the band with your arm that is closest to the band’s attachment point. Keep your upper arm close to your side, and bend your elbow to 90 degrees.",
            "Rotate your upper arm internally (inwards) against the resistance of the band, as far as possible.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": "Internal rotations against an elastic band train your anterior rotator cuff muscles (subscapularis)."
    },
    {
        "title": "band-pull-apart",
        "primary_muscles": [
            "Rear Deltoid",
            "Rotator Cuff"
        ],
        "secondary_muscles": [
            "Trapezius"
        ],
        "instructions": [
            "Grab an elastic band, and hold it out before you on straight arms.",
            "Pull the band apart by moving your arms to the sides as far as you can, or until your arms are pointing straight out.",
            "Return with control to the starting position."
        ],
        "comments": "Band pull-apart is a popular warm-up exercise for the shoulders, often done before upper body exercises such as bench press. Experiment with your grip width on the band, as well as band strength, to find the right resistance."
    },
    {
        "title": "barbell-front-raise",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Lateral Deltoid"
        ],
        "instructions": [
            "Hold a barbell in straight arms, in front of your body.",
            "With control, lift the barbell forward with straight arms, until the bar is at shoulder height.",
            "Reverse the movement and lower the bar with control."
        ],
        "comments": "This is an exercise where it is easy to pick a weight that is too heavy. Rather err on the lighter side, and strive for a strict form where you focus on getting a good contact with your delts."
    },
    {
        "title": "barbell-rear-delt-row",
        "primary_muscles": [
            "Rear Deltoid",
            "Trapezius"
        ],
        "secondary_muscles": [
            "Rotator Cuff",
            "Biceps",
            "Forearm Flexors"
        ],
        "instructions": [
            "Grip the bar with a wide overhand grip, and lean forward with the bar hanging from straight arms.",
            "Inhale and pull the bar high on your chest, with your upper arms pointing straight out to the sides.",
            "With control, lower the bar back to the starting position."
        ],
        "comments": "Barbell rear delt row is a great rear delt exercise. To avoid cheating or swinging the weight up, make sure you use a light weight and focus on muscle contact with your rear delts."
    },
    {
        "title": "barbell-upright-row",
        "primary_muscles": [
            "Lateral Deltoid"
        ],
        "secondary_muscles": [
            "Front Deltoid",
            "Trapezius",
            "Biceps"
        ],
        "instructions": [
            "Grip the bar with an overhand grip, slightly narrower than shoulder-width apart.",
            "Pull the bar straight up until it is at the level of your chin.",
            "With control, lower the bar back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "behind-the-neck-press",
        "primary_muscles": [
            "Front Deltoid",
            "Lateral Deltoid"
        ],
        "secondary_muscles": [
            "Trapezius",
            "Triceps"
        ],
        "instructions": [
            "Grab a bar slightly wider than shoulder-width apart, and duck under it so that it is resting against the base of your neck.",
            "Take a breath, lightly brace your core, and unrack the bar. Take a step back.",
            "Press the bar up until your arms are straight, while exhaling.",
            "Inhale at the top, or while lowering the bar with control back to the base of your neck.",
            "Repeat for reps."
        ],
        "comments": "Behind the neck press trains the strength, stability, and mobility of your shoulders. This exercise can also be performed with the aid of your legs, like in a push press or jerk."
    },
    {
        "title": "cable-lateral-raise",
        "primary_muscles": [
            "Lateral Deltoid"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Grip a handle connected to the lower position on a cable pulley. Stand close to the pulley, with the arm holding the handle facing away from the machine.",
            "With control, lift the handle outwards to your sides, until your upper arm is horizontal.",
            "Lower the handle with control.",
            "Repeat for reps."
        ],
        "comments": "This is an exercise where it is easy to pick a weight that is too heavy. Rather err on the lighter side, and strive for a strict form where you focus on getting good contact with your delts."
    },
    {
        "title": "cable-rear-delt-row",
        "primary_muscles": [
            "Rear Deltoid",
            "Rotator Cuff"
        ],
        "secondary_muscles": [
            "Trapezius",
            "Biceps"
        ],
        "instructions": [
            "Fasten a rope handle in a high position on a cable pulley. Grip the ropes with an overhand grip, and take a step or two back.",
            "With elbows held high, pull the rope towards you by letting your upper arms move straight out towards your sides. Pull your scapulas together in the end position.",
            "Return with control to the starting position, by letting your arms move forward again."
        ],
        "comments": "This variation of the cable row focus the work to the rear deltoids and your upper back musculature. Start with a light weight in this exercise, and prioritize form and muscle contact before weights."
    },
    {
        "title": "cuban-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Lateral Deltoid",
            "Read Deltoid",
            "Trapezius",
            "Triceps"
        ],
        "instructions": [
            "Stand with feet shoulder-width apart, holding a pair of dumbbells with an overhand grip (palms facing down).",
            "Lift the dumbbells in a controlled motion up to shoulder height, with your elbows in line with your shoulders.",
            "Once the dumbbells reach shoulder height, rotate your shoulders outward, lifting the dumbbells and turning your wrists so your palms face forward.",
            "Press the dumbbells overhead to full extension.",
            "Reverse the movement by lower the dumbbells back to shoulder height, rotate the shoulders inward, and then lower the dumbbells back to the starting position in front of your thighs.",
            "Repeat the movement for the desired number of repetitions."
        ],
        "comments": "The Cuban Press is a good exercise for targeting your shoulders and rotator cuff, helping with stability and strength in overhead movements."
    },
    {
        "title": "dumbbell-front-raise",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Lateral Deltoid"
        ],
        "instructions": [
            "Hold a pair of dumbbells in straight arms, in front of your hip.",
            "With control, lift the dumbbells forward with straight arms, until the dumbbells are at shoulder height.",
            "Reverse the movement and lower the dumbbells with control."
        ],
        "comments": "This is an exercise where it is easy to pick a weight that is too heavy. Rather err on the lighter side, and strive for a strict form where you focus on getting good contact with your delts."
    },
    {
        "title": "dumbbell-horizontal-internal-shoulder-rotation",
        "primary_muscles": [
            "Rotator Cuff (anterior)"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Lie down on your back, with your upper arm out to your side at 90 degrees, and your elbow bent to 90 degrees.",
            "With a dumbbell, rotate your arm internally (upwards) against the direction of resistance until your forearm is vertical.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": "Internal rotations train your anterior rotator cuff muscles (subscapularis)."
    },
    {
        "title": "dumbbell-horizontal-external-shoulder-rotation",
        "primary_muscles": [
            "Rotator Cuff (posterior)"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand sideways to a barbell, set slightly below your shoulder height, so that your upper arm is horizontal when you are resting it on the bar.",
            "Hold a dumbbell in your hand, and bend your elbow to 90 degrees.",
            "Rotate your arm externally (upwards) against the direction of resistance, as far as possible.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": "External rotations train your posterior rotator cuff muscles, mainly infraspinatus and teres minor."
    },
    {
        "title": "dumbbell-lateral-raise",
        "primary_muscles": [
            "Lateral Deltoid"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Hold a pair of dumbbells in almost straight arms hanging by your sides.",
            "With control, lift the dumbbells out to your sides until your upper arms are horizontal.",
            "Lower the dumbbells with control.",
            "Repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-rear-delt-row",
        "primary_muscles": [
            "Rear Deltoid",
            "Trapezius"
        ],
        "secondary_muscles": [
            "Rotator Cuff",
            "Biceps",
            "Forearm Flexors"
        ],
        "instructions": [
            "Lean forward with a dumbbell in each hand.",
            "Inhale and make a wide rowing motion, where you let your upper arms go out towards the sides.",
            "With control, lower the dumbbells back to the starting position."
        ],
        "comments": "The dumbbell rear delt row is a great rear delt exercise. To avoid cheating or swinging the weights up, make sure you use light weights and focus on muscle contact with your rear deltoids."
    },
    {
        "title": "dumbbell-shoulder-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Grab a pair of dumbbells, and lift them up to the starting position at your shoulders.",
            "Inhale and lightly brace your core.",
            "Press the dumbbells up to straight arms, while exhaling.",
            "Inhale at the top, or while lowering the dumbbells with control back to your shoulders.",
            "Repeat for reps."
        ],
        "comments": "The dumbbell shoulder press is a variant of the barbell overhead press. The dumbbells increase the demand for shoulder stability, and can also enable a longer range of motion. With dumbbells, you might also be able to move your arms more to your sides compared to a barbell, which can emphasize the training effect of the medial deltoids."
    },
    {
        "title": "face-pull",
        "primary_muscles": [
            "Rear Deltoid",
            "Rotator Cuff"
        ],
        "secondary_muscles": [
            "Trapezius",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Fasten a rope handle in a high position on a cable pulley. Grip the ropes with an overhand grip, and take a step or two back.",
            "With elbows held high, pull the rope towards you by letting your upper arms move straight out towards your sides while simultaneously rotating your forearms up.",
            "Return with control to the starting position by letting your arms move forward again."
        ],
        "comments": ""
    },
    {
        "title": "front-hold",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Lateral Deltoid"
        ],
        "instructions": [
            "Hold a plate in straight arms, in front of your body.",
            "With control, lift the plate forward with straight arms, until the bar is at shoulder height.",
            "Hold still."
        ],
        "comments": "This is an exercise where it is easy to pick a weight that is too heavy. Rather err on the lighter side, and strive for a strict form where you focus on getting good contact with your delts."
    },
    {
        "title": "landmine-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Chest"
        ],
        "instructions": [
            "Stand with your core activated and the feet about shoulder-width apart.",
            "Place the barbell in one hand, and rest it on your shoulder.",
            "Press to lockout by extending the elbow and flexing the shoulder.",
            "Slowly lower the barbell back to the starting position on your shoulder.",
            "Repeat for reps."
        ],
        "comments": "The landmine press is a variation of the shoulder press where you can work one side at a time even if your only equipment is a barbell. You can also perform the exercise with both hands on the bar, leading to more activation in your upper chest muscles."
    },
    {
        "title": "lying-dumbbell-external-shoulder-rotation",
        "primary_muscles": [
            "Rotator Cuff (posterior)"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Lie down on your side, with your upper arm close to your side, and your elbow bent to 90 degrees.",
            "Grab a dumbbell and rotate your arm externally (upwards) against the direction of resistance, as far as possible.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": "External rotations train your posterior rotator cuff muscles, mainly infraspinatus."
    },
    {
        "title": "lying-dumbbell-internal-shoulder-rotation",
        "primary_muscles": [
            "Rotator Cuff (anterior)"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Lie down on your side, with your arm close to your side, and your elbow bent to 90 degrees.",
            "With a dumbbell, rotate your arm internally (upwards) against the direction of resistance, as far as possible.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": "Internal rotations train your anterior rotator cuff muscles (subscapularis)."
    },
    {
        "title": "machine-lateral-raise",
        "primary_muscles": [
            "Lateral Deltoid"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Adjust the machine so that the pads are leaning against your elbows.",
            "Lift your arms out to your sides, until your upper arms are horizontal.",
            "Lower the arms again."
        ],
        "comments": "This is an exercise where it is easy to pick a weight that is too heavy. Rather err on the lighter side, and strive for a strict form where you focus on getting good contact with your delts."
    },
    {
        "title": "machine-shoulder-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Adjust the machine to the appropriate settings, sit down, and grip the handles.",
            "Press the handles upwards until your arms are straight.",
            "Lower the handles with control."
        ],
        "comments": "The machine shoulder press is an exercise that offers more stability and requires less balance and coordination than shoulder presses with for example dumbbells or a barbell. That could lead to an increased focus on the muscles worked, and also makes it easy to learn for a beginner."
    },
    {
        "title": "monkey-row",
        "primary_muscles": [
            "Lateral Deltoid"
        ],
        "secondary_muscles": [
            "Rear Deltoid",
            "Trapezius",
            "Biceps"
        ],
        "instructions": [
            "With your arms by your sides, hold a dumbbell in each hand.",
            "Pull the dumbbells straight up as far as you can.",
            "With control, lower the dumbbells back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "overhead-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "First, place a barbell in a rack at about chest height.",
            "Grip the bar slightly wider than shoulder-width apart, and step close to it.",
            "Inhale, lightly brace your core, and unrack the bar.",
            "Let the bar rest against your front delts while you step back from the rack.",
            "Press the bar up to straight arms while exhaling.",
            "Inhale at the top or while lowering the bar with control back to your shoulders.",
            "Repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "plate-front-raise",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Lateral Deltoid"
        ],
        "instructions": [
            "Hold a plate in straight arms, in front of your body.",
            "With control, lift the plate forward with straight arms, until the bar is at shoulder height.",
            "Reverse the movement and lower the plate with control."
        ],
        "comments": "This is an exercise where it is easy to pick a weight that is too heavy. Rather err on the lighter side, and strive for a strict form where you focus on getting good contact with your delts."
    },
    {
        "title": "power-jerk",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back",
            "Trapezius",
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Get into the starting position by cleaning the bar or lifting it out from a rack. Grip the bar slightly wider than shoulder-width apart, and let it rest on the front of your shoulders.",
            "Hold your breath and brace your core slightly.",
            "Slightly bend your knees, and then forcefully extend them to push the bar up.",
            "Duck under the bar and catch it on straight arms, by slightly bending your knees.",
            "Stand up on straight legs again.",
            "Lower the bar in front of you, with control, or lower it back unto the front of your shoulders."
        ],
        "comments": "The power jerk is a variant of jerk that differs from the split jerk in that you keep your feet parallel throughout the lift. Another variant is the squat jerk, which resembles the power jerk, but you catch the bar in an even deeper squatting position."
    },
    {
        "title": "push-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back",
            "Trapezius",
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Clean a bar to your shoulders, or lift it out from a rack.",
            "Let the bar rest against the front of your shoulders, with your grip slightly outside your shoulders.",
            "Inhale and lightly brace your core.",
            "Bend your knees, and then forcefully push yourself and the bar upwards using your legs.",
            "When your legs are extended, immediately start pressing the bar with your arms, until your arms are fully extended.",
            "With control, lower the bar back to your shoulders."
        ],
        "comments": "The push press is a variant of the overhead press where you use your legs to help lift the bar. In the push press you only bend your knees once, when you accelerate the bar, as opposed to a jerk, where you bend your knees a second time to catch the bar on straight arms."
    },
    {
        "title": "reverse-cable-fly",
        "primary_muscles": [
            "Rear Deltoid",
            "Rotator Cuff"
        ],
        "secondary_muscles": [
            "Trapezius"
        ],
        "instructions": [
            "Attach two handles in the upper pulleys of a cable crossover.",
            "Reach across your body and grab the handle from the right side of the machine with your left hand and the left handle with your right.",
            "Position yourself in the center of the machine. Keep your arms straight ahead, your chest up, and brace your core.",
            "Keep the elbows slightly bent while pulling your arms backward until they are about parallel to your body.",
            "Reverse the movement.",
            "Repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "reverse-dumbbell-flyes",
        "primary_muscles": [
            "Rear Deltoid",
            "Rotator Cuff"
        ],
        "secondary_muscles": [
            "Trapezius"
        ],
        "instructions": [
            "Hold a pair of dumbbells, lean forward, and let your arms hang towards the floor.",
            "With almost straight arms (just a slight bend at the elbow), slowly lift the dumbbells by raising your arms out to the sides.",
            "Reverse the movement and lower the dumbbells back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "reverse-machine-fly",
        "primary_muscles": [
            "Rear Deltoid",
            "Rotator Cuff"
        ],
        "secondary_muscles": [
            "Trapezius"
        ],
        "instructions": [
            "Adjust the chest support and handles so that you can grip the handles at shoulder height and get a long range of motion.",
            "With just a slight bend in the arms, pull the handles backward by bringing your arms out to the sides.",
            "Reverse the movement and let the handles go back to the starting position."
        ],
        "comments": "Reverse machine flyes is an isolation exercise for the muscles that horisontally extend your upper arms, and thus trains many of the antagonists of common pressing exercises."
    },
    {
        "title": "seated-dumbbell-shoulder-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Sit down on a bench with a raised backrest.",
            "Grab a pair of dumbbells and lift them up to the starting position at your shoulders.",
            "Inhale and lightly brace your core.",
            "Press the dumbbells up to straight arms while exhaling.",
            "Inhale at the top or while lowering the dumbbells with control back to your shoulders.",
            "Repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "seated-barbell-overhead-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Sit down on a bench with a raised backrest. The bench should be placed close to a rack, where a barbell rests at about shoulder height.",
            "Grip the bar with an overhand grip.",
            "Inhale, lightly brace your core, and unrack the bar. Lean back on the backrest.",
            "Press the bar up to straight arms, while exhaling.",
            "Inhale at the top, or while lowering the bar with control back to your shoulders.",
            "Repeat for reps."
        ],
        "comments": "The press is a classic upper-body exercise, and a staple when it comes to building up your shoulder. By sitting down, you reduce the need for core stabilization and can focus more on the actual pressing and primarily working muscles."
    },
    {
        "title": "seated-smith-machine-shoulder-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Sit on a bench, unrack a barbell and lower it to the starting position at the top of your chest.",
            "Press the bar up to straight arms, while exhaling.",
            "Inhale at the top, or while lowering the bar with control back to your chest.",
            "Repeat for reps."
        ],
        "comments": "Smith machine shoulder press differs from a free barbell press primarily by its completely fixed bar path, which lessens the requirements of stabilization and balance. This can make it easier to focus on the muscles trained."
    },
    {
        "title": "snatch-grip-behind-the-neck-press",
        "primary_muscles": [
            "Front Deltoid",
            "Lateral Deltoid"
        ],
        "secondary_muscles": [
            "Trapezius",
            "Triceps"
        ],
        "instructions": [
            "Grab a bar with a snatch grip width, and duck under it so that it is resting against the base of your neck.",
            "Take a breath, lightly brace your core, and unrack the bar. Take a step back.",
            "Press the bar up until your arms are straight, while exhaling.",
            "Inhale at the top, or while lowering the bar with control back to the base of your neck.",
            "Repeat for reps."
        ],
        "comments": "Snatch grip behind the neck press trains the strength, stability, and mobility of your shoulders. This exercise can also be performed with the aid of your legs, like in a push press or jerk."
    },
    {
        "title": "squat-jerk",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Adductors",
            "Quads",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Trapezius",
            "Triceps",
            "Lateral Deltoid",
            "Calves"
        ],
        "instructions": [
            "Get into the starting position by cleaning the bar or lifting it out from a rack. Grip the bar slightly wider than shoulder-width apart, and let it rest on the front of your shoulders.",
            "Hold your breath, and brace your core slightly.",
            "Slightly bend your knees, and then forcefully extend them to push the bar up.",
            "Duck under the bar and catch it on straight arms, by bending your knees like in a squat.",
            "Stand up on straight legs again.",
            "Lower the bar in front of you, with control, or lower it back unto the front of your shoulders."
        ],
        "comments": "The squat jerk is a variant of jerk that differs from the split jerk in that you keep your feet parallel throughout the lift. Another variant is the power jerk, which resembles the squat jerk, but you only bend your knees slightly, as opposed to the deep squatting position of the squat jerk."
    },
    {
        "title": "split-jerk",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back",
            "Trapezius",
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Get into the starting position by cleaning the bar or lifting it out from a rack. Grip the bar slightly wider than shoulder-width apart, and let it rest on the front of your shoulders.",
            "Hold your breath and brace your core slightly.",
            "Slightly bend your knees, and then forcefully extend them to push the bar up.",
            "Duck under the bar and catch it on straight arms, with your legs in a lunge position.",
            "First take a step back with your front foot and then step forward with your back foot, until you’re standing with your feet side by side again, while controlling the bar on straight arms above your head.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The split jerk is a variant of jerk that differs from the squat jerk and power jerk in that you receive the bar in a lunge position."
    },
    {
        "title": "barbell-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Grip a bar with an underhand (supinated) grip, hands about shoulder-width apart.",
            "Lift the bar with control, by flexing your elbows.",
            "Don’t let your upper arm travel back during the curl, keep it at your side or move it slightly forward.",
            "Reverse the movement and lower the bar back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "barbell-preacher-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Grab a barbell and sit down at a preacher curl bench, resting your upper arms against the pad.",
            "Lower the barbell as far as you can, with control.",
            "Reverse the motion and return to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "bodyweight-curl",
        "primary_muscles": [
            "Biceps",
            "Lats"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Grab the handles of your TRX (or your rings), and stand with your body facing the anchor point.",
            "Keep your feet close towards the anchor point, leaning back with the cables tensioned. Keep your core activated the entire time.",
            "In the starting position, keep your arms straight and the palms facing toward your face. At this point, the elbows should be higher up than the shoulders.",
            "Slowly bend your arms with control and curl yourself towards the handles.",
            "Reverse the movement and repeat for reps."
        ],
        "comments": "The bodyweight curl is an alternative way to build arm strength if you don’t have access to any free weights. All you need is an area where the rope or rings can be securely attached and you are ready to exercise"
    },
    {
        "title": "cable-curl-with-bar",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Fasten a bar in the lower position of a cable cross. Grip the bar with an underhand (supinated) grip, hands about shoulder-width apart, and take a step back.",
            "Lift the bar with control, by flexing your elbows.",
            "Don’t let your upper arm travel back during the curl, keep it still or move it slightly forward.",
            "Reverse the movement and lower the bar back to the starting position."
        ],
        "comments": "The cable curl is an alternative to the barbell curl that offers more of a constant tension on your muscles throughout the movement. Because the direction of pull is slightly diagonal to the ground, it is harder for the arm flexors to relax in this exercise. This might be beneficial for muscle growth."
    },
    {
        "title": "cable-curl-with-rope",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Fasten a rope in the lower position of a cable cross. Grip the rope with a neutral grip and take a step back.",
            "Lift the rope with control, by flexing your elbows.",
            "Don’t let your upper arm travel back during the curl, keep it still or move it slightly forward.",
            "Reverse the movement and lower the rope back to the starting position."
        ],
        "comments": "Cable curl is an alternative to the barbell curl that offers more of a constant tension on your muscles throughout the movement. Because the direction of pull is slightly diagonal to the ground, it is harder for the arm flexors to relax in this exercise. This might be beneficial for muscle growth."
    },
    {
        "title": "concentration-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Sit on a bench with a dumbbell in hand. Lean your elbow onto the inside of your leg.",
            "Lift the dumbbell with control by flexing your elbow.",
            "Reverse the movement and lower the dumbbell back to the starting position."
        ],
        "comments": "Concentration curl is an exercise where it is easy to focus on the muscle contact with your biceps, and it is difficult to cheat by letting other muscles take over the work."
    },
    {
        "title": "dumbbell-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Hold a pair of dumbbells in an underhand (supinated) grip, arms hanging by your sides.",
            "Lift the dumbbells with control, by flexing your elbows.",
            "Don’t let your upper arms travel back during the curl. Keep them at your sides, or move them slightly forward.",
            "Reverse the movement and lower the dumbbells back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-preacher-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Use a preacher curl bench, or position the back rest of a regular training bench so that it leans back slightly.",
            "Grab a dumbbell, stand behind the bench, and rest your upper arm against the back rest.",
            "Lower the dumbbell as far as you can, and then reverse the motion, returning to the starting position."
        ],
        "comments": "The preacher curl is an effective exercise for isolating and focusing on the arm flexors. If fully extending your arm feels uncomfortable, you can avoid that position by reversing the movement earlier."
    },
    {
        "title": "hammer-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Hold a pair of dumbbells in a neutral grip (palms facing each other), arms hanging by your sides.",
            "Lift the dumbbells with control by flexing your elbows.",
            "Don’t let your upper arms travel back during the curl. Keep them at your sides, or move them slightly forward.",
            "Reverse the movement and lower the dumbbells back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "incline-dumbbell-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Grab a pair of dumbbells, and sit down on an inclined bench. Let your arms hang straight down by your sides.",
            "Lift the dumbbells with control, by flexing your elbows.",
            "Reverse the movement and lower the dumbbells back to the starting position."
        ],
        "comments": "Incline dumbbell curl is an exercise where biceps brachii works at a slightly longer muscle lengths than in regular bicep curls. This is because the biceps originates from the shoulder blade, and is thus extended when your arm is behind your body, like in this exercise. This position can potentially lead to greater muscle growth than regular curls. Another consequence is that it is slightly harder to cheat with your technique in this exercise."
    },
    {
        "title": "machine-bicep-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Adjust the machine so that you are correctly positioned. Your upper arms should rest on the padding, and your elbows should be in line with the machine’s joint.",
            "Grab the handles with an underhand grip around shoulder width apart.",
            "Curl the weight up as far as possible. Make sure to do the entire movement at a controlled speed.",
            "Revert the movement, and stop just before the weights hit the stacks.",
            "Repeat for reps."
        ],
        "comments": "Machine Bicep Curls are a good exercise for the beginner or if you want to squeeze out the last of your muscles. This since you are being put in the correct position by the machine and don’t have to worry about balance or cheating."
    },
    {
        "title": "spider-curl",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Lie down on your chest and stomach on a 45-degree bench, holding a pair of dumbbells in an underhand (supinated) grip.",
            "With your upper arms vertical, lift the dumbbells with control, by flexing your elbows.",
            "Don’t let your upper arms travel back or forwards during the curl. Keep the movement to your forearms only.",
            "Reverse the movement and lower the dumbbells back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "barbell-standing-triceps-extension",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grip a barbell with a close grip, and lift it up to straight arms over your head.",
            "Lower the barbell behind your head while keeping your upper arms still and vertical.",
            "Reverse the motion and extend your arms again."
        ],
        "comments": ""
    },
    {
        "title": "barbell-lying-triceps-extension",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Lie down on a bench with your head close to the edge. Hold a barbell with a shoulder-wide grip, and lift it up to straight arms over yourself.",
            "Lower the barbell down behind your head. Try to keep the same distance between your elbows throughout the movement.",
            "Reverse the motion and extend your arms again."
        ],
        "comments": ""
    },
    {
        "title": "bench-dip",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "instructions": [
            "Turn your back towards a sturdy training bench, and put your hands on the pad about shoulder-width apart. Extend your legs in front of you.",
            "Lower yourself with control for as far as comfortable by bending your arms.",
            "Reverse the motion and return to the starting position."
        ],
        "comments": "The bench dip is a variant of the bar dip that utilizes a bench instead of a dip station. This exercise puts more emphasis on your triceps than the bar dip does, which instead emphasizes your chest and front delts more."
    },
    {
        "title": "close-grip-push-up",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": [
            "Abs",
            "Chest",
            "Front Deltoid"
        ],
        "instructions": [
            "Assume the starting position, with hands shoulder-width apart.",
            "Try to form a straight line from head to feet and brace your abdomen slightly.",
            "Lower yourself as deep as you can, while inhaling.",
            "Reverse the motion when you’ve touched the floor and push yourself up to straight arms again while exhaling.",
            "Repeat for reps."
        ],
        "comments": "The push-up is a classic bodyweight exercise for the upper body, with the benefit that you don’t need any equipment to perform it."
    },
    {
        "title": "dumbbell-lying-triceps-extension",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Lie down on a bench which your head close to the edge. Hold a pair of dumbbells with your arms pointing straight up.",
            "Lower the dumbbell down behind your head. Try to keep the same distance between your elbows throughout the movement.",
            "Reverse the motion and extend your arms again."
        ],
        "comments": "The lying triceps extension is a very effective tricep exercise that besides extending your elbow joint also trains the triceps function to bring your upper arm down towards your midline."
    },
    {
        "title": "dumbbell-standing-triceps-extension",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Lift a dumbbell up to a straight arm over your head.",
            "Lower the dumbbell down behind your head, while keeping your upper arm still and vertical.",
            "Reverse the motion and extend your arm again."
        ],
        "comments": "The standing triceps extension is an effective exercise for isolating the tricep muscle. Common variations of this exercise is to use a small barbell or a heavier dumbbell which you hold with both hands."
    },
    {
        "title": "overhead-cable-triceps-extension",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Fasten a rope handle in the lower position of a cable pulley. Stand with your back against the pulley, with a slight forward lean, and hold the rope behind your head and your upper arms next to your ears.",
            "Straighten your elbows until your arms are fully extended.",
            "Reverse the motion by bending your arms again."
        ],
        "comments": ""
    },
    {
        "title": "triceps-bodyweight-extension",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab the bar using an overhead grip, with your hands about shoulder-width apart.",
            "At the starting position, your arms should be fully extended, and your core and glutes activated as in a standing plank position.",
            "Bend the arms, bring your torso forward, and lower your head below the bar. Do the movement slow and controlled.",
            "Reverse the movement by straightening your arms.",
            "Repeat for reps."
        ],
        "comments": "This is a good alternative for triceps training if you don’t have access to free weights. If you want to make the movement easier, set the bar higher. If you want to make it harder, set it lower."
    },
    {
        "title": "tricep-pushdown-with-bar",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand one step away from the cable pulley, and grip a bar about shoulder-width apart.",
            "Pull the handle down until your upper arms are perpendicular to the floor. This is the starting position.",
            "Push the handle down until your arms are fully extended.",
            "With control, let the handle up again."
        ],
        "comments": ""
    },
    {
        "title": "tricep-pushdown-with-rope",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Fasten a rope handle in the upper position of a cable pulley. Grip the rope with an overhand grip, and take one step back from the pulley.",
            "Pull the rope down until your upper arms are perpendicular to the floor. This is the starting position.",
            "Push the rope down until your arms are fully extended.",
            "With control, let the rope up again."
        ],
        "comments": ""
    },
    {
        "title": "air-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Stand with your feet about shoulder width apart.",
            "Squat as deep as possible.",
            "Reverse the movement, and return to a standing position."
        ],
        "comments": "The air squat is a classic exercise that requires no equipment. For the beginner, this exercise might initiate a strength gain all on its own, and for the more experienced trainee it might serve as a mobility-increasing exercise, warm-up or rehabilitation. You can aid your balance in this exercise by holding out your arms in front of you, or even holding a light weight, like in a goblet squat."
    },
    {
        "title": "barbell-hack-squat",
        "primary_muscles": [
            "Quads"
        ],
        "secondary_muscles": [
            "Glutes",
            "Adductors",
            "Lower Back",
            "Trapezius",
            "Forearm Flexors",
            "Calves"
        ],
        "instructions": [
            "Stand in front of a bar. Squat down and grip the bar with your arms outside your legs.",
            "Inhale, brace your core slightly, and lift the bar.",
            "Pull the bar close to your body, with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "The barbell hack squat is an old-school lift and an alternative to regular hack squats if you don’t have access to a machine."
    },
    {
        "title": "barbell-lunge",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Take a big step forward and sink as deep as possible in a lunge position, without hitting the knee of the back leg in the floor.",
            "Return to the starting position by pushing yourself back with the front leg."
        ],
        "comments": "The lunge is an exercise that not only strengthens your leg muscles, but it can also be used to train your balance, coordination and control. An alternative to using a barbell for external load, is to hold weights (i.e. dumbbells or kettlebells) in your hands."
    },
    {
        "title": "barbell-walking-lunges",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand with your feet at shoulder-width apart, with a slight bend in the knees. Make sure that your core is engaged.",
            "Step forward with one of your legs, bending both knees at the same time. Stop the movement just before the back knee touches the floor, you should have about a 90-degree angle in both knees.",
            "Drive through your front foot and extend the knee until you get back to a standing position.",
            "Continue by repeating the movement on the other side.",
            "Repeat for reps."
        ],
        "comments": "The lunge is an exercise that not only strengthens your leg muscles, it can also be used to train your balance, coordination, and knee control. An alternative to the walking lunges is to stay in one place, performing all reps for one leg first before switching to the other."
    },
    {
        "title": "belt-squats",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Place the belt around your waist properly, and attach it to the machine.",
            "Make sure that you’re standing accordingly to your normal squat stance. Inhale and brace your core slightly, and unrack the weight.",
            "Squat as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again.",
            "Exhale on the way up or exchange air in the top position.",
            "Inhale and repeat for reps."
        ],
        "comments": "The belt squat is a good alternative to the Barbell Squat. The movement is similar, but the weight placement helps you put less tension on your lower back."
    },
    {
        "title": "body-weight-lunge",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Take a big step forward and sink as deep as possible in a lunge position, without hitting the knee of the back leg in the floor.",
            "Return to the starting position by pushing yourself back with the front leg."
        ],
        "comments": "The lunge is a body weight exercise that not only strengthens your leg muscles, but it can also be used to train your balance, coordination and control. You can make the exercise heavier by holding weights in your hands."
    },
    {
        "title": "bodyweight-leg-curl",
        "primary_muscles": [
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Glutes"
        ],
        "instructions": [
            "Lie on your back with your socked heels on a hardwood floor.",
            "Use your hamstrings to pull your heels back in towards your butt until they are underneath your knees.",
            "Slowly extend your heels away from your body, straightening out your knees. Try to extend your legs out as far as possible. Maintain tension in your hamstrings to control the movement.",
            "Repeat for reps."
        ],
        "comments": "This is an alternative to strengthen your hamstrings even if you can’t access a barbell or dumbbells. All you need is a pair of socks (or a towel) and a kitchen floor or hardwood floor."
    },
    {
        "title": "box-jump",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Stand in front of a sturdy box with your feet shoulder-width apart.",
            "Slightly bend your knees and lower into a half-squat while swinging your arms back.",
            "Explode upward by pushing off the ground with your feet and swinging your arms forward to create momentum.",
            "Jump onto the box, landing softly with your knees slightly bent, feet fully on the box, and your torso upright.",
            "Stand up fully once you’ve landed on the box.",
            "Step, or carefully jump, down and repeat for the desired number of repetitions."
        ],
        "comments": "Box Jumps are a plyometric exercise that develops explosiveness, power, and coordination. They target the lower body and improve cardiovascular endurance."
    },
    {
        "title": "box-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Place the bar on your upper back, inhale and brace your core slightly, and unrack the bar.",
            "Take two steps back, and adjust your foot position.",
            "Squat down to a box, set at your desired heigth.",
            "Stand up again. Exhale on the way up, or exchange air in the top position.",
            "Inhale and repeat for reps."
        ],
        "comments": "The box squat is a variant of the squat where you use a box (or bench or similar) to squat down against."
    },
    {
        "title": "bulgarian-split-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand with your back turned against a bench, which should be at about knee height. Stand about one long step in front of the bench.",
            "Place one foot on the bench behind you.",
            "Inhale, look forward, and squat down with control until right before the knee of the back leg touches the floor.",
            "Reverse the movement and extend your front leg again, while exhaling.",
            "Inhale at the top and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "chair-squats",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Stand with your feet about shoulder width apart, or where you feel comfortable.",
            "Squat until you touch the chair.",
            "Reverse the movement, and return to a standing position."
        ],
        "comments": "This is the home version of the box squat. It is suitable if you can not do a squat with full depth yet, or if you want to restrict the depth because of an injury."
    },
    {
        "title": "dumbbell-lunge",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Hold a dumbbell in each hand and stand with your feet about shoulder width apart.",
            "Take a big step forward and sink as deep as possible in a lunge position, without hitting the knee of the back leg in the floor.",
            "Return to the starting position by pushing yourself back with the front leg."
        ],
        "comments": "The lunge is an exercise that not only strengthens your leg muscles, but it can also be used to train your balance, coordination and control."
    },
    {
        "title": "dumbbell-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Hold a dumbbell in each hand, and stand with your feet about shoulder width apart.",
            "Inhale, lightly brace your core, and squat down as deep as possible.",
            "Reverse the movement, and return to a standing position. Exhale on the way up."
        ],
        "comments": "The dumbbell squat is a squatting variant that differs from the traditional barbell squat in several ways. Two advantages of the dumbbell squat are that it is easy to learn, and you can drop the weights at any moment if you need to. That can make this exercise suitable for beginners, children och the elderly, for example. A disadvantage compared to the barbell squat is that it is difficult to use very heavy weights in this exercise, which means that you eventually might have difficulties increasing the load."
    },
    {
        "title": "front-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Grip the bar slightly wider than shoulder-width. Step forward and place the bar on the front of your shoulders: on top of your clavicles, and tight against your throat.",
            "Inhale and brace your core slightly, and unrack the bar.",
            "Take two steps back, and adjust your foot position.",
            "Squat as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again.",
            "Exhale on the way up or exchange air in the top position.",
            "Breathe in and repeat for reps."
        ],
        "comments": "The front squat is a variation of the barbell squat. This exercise shifts more work to your quadriceps, and also your back muscles have to work against a longer moment arm. The exercise mimics the catch position of a clean, and it is therefore a common exercise among Olympic weightlifters."
    },
    {
        "title": "goblet-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Lower Back",
            "Calves"
        ],
        "instructions": [
            "Grab a kettlebell in the sides of the handle, and hold the kettlebell against your chest.",
            "Stand with your feet about shoulder-width apart, and your toes pointing slightly outward.",
            "Inhale, lightly brace your core, and squat down as deep as possible.",
            "Reverse the movement and return to the starting position. Exhale on the way up."
        ],
        "comments": ""
    },
    {
        "title": "hack-squat-machine",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine to the correct height and place your shoulders against the shoulder pads.",
            "Put your feet on the plate, slightly in front of the base of the sled and about shoulder width apart.",
            "Extend your legs and disengage the sled’s locks.",
            "Inhale, brace your core lightly, and squat down as deep as you can with good form.",
            "Reverse the movement with control, and extend your legs again until you’re back in the starting position. Exhale on the way up."
        ],
        "comments": ""
    },
    {
        "title": "half-body-weight-squats",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Stand with your feet about shoulder width apart, or where you feel comfortable.",
            "Squat as deep as possible, or as deep as you want.",
            "Reverse the movement, and return to a standing position."
        ],
        "comments": "The air squat is a classic exercise that requires no equipment. For the beginner, this exercise might initiate a strength gain all on it’s own, and for the more experienced trainee it might serve as a mobility-increasing exercise, warm-up or rehabilitation. You can aid your balance in this exercise by holding out your arms in front of you, or even holding a light weight, like in a goblet squat."
    },
    {
        "title": "hip-adduction-machine",
        "primary_muscles": [
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine to the appropriate settings, sit down with your legs outside the pads, and grip the handles.",
            "Push the pads toward each other by bringing your legs together.",
            "Return with control to the starting position."
        ],
        "comments": "The hip adduction machine trains the muscles that adduct (brings together) your thighs."
    },
    {
        "title": "jumping-lunges",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Take a big step forward with your right leg and sink as deep as possible in a lunge position without hitting the knee of the back leg on the floor.",
            "Explosively jump up, switching the position of your legs while in mid-air. As you land, make sure to soften the landing and go directly into the lunge position with your left leg forward. Your front knee should be over your ankle and your back knee should be pointing down towards the floor.",
            "Continue alternating legs with each jump. Maintain a steady pace and keep your torso upright throughout the exercise."
        ],
        "comments": "Jumping lunges are an alternative to regular lunges. The explosive jumping motion enhances muscle power and agility, targeting more muscle groups than a regular lunge. It’s an excellent way to improve balance and coordination while making it a highly efficient exercise for those looking to elevate their workout intensity."
    },
    {
        "title": "landmine-hack-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Place one end of a barbell into a corner. Facing away from the bar, place the other end on one of your shoulders.",
            "Inhale and brace your core lightly. Squat down as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again until you are standing up."
        ],
        "comments": "The landmine hack squat is a blend of the hack squat and the landmine squat. In similarity to these exercises, the landmine hack squat primarily targets your leg muscles and does not place a lot of load on your lower back."
    },
    {
        "title": "landmine-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Lower Back",
            "Calves"
        ],
        "instructions": [
            "Place one end of a barbell into a corner. Grip the other end with both of your hands and rest your hands against the top of your chest.",
            "Inhale and brace your core lightly. Squat down as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again until you are standing up."
        ],
        "comments": "The landmine squat is a relatively stable squatting exercise that doesn’t require a lot of mobility or tax your lower back very much. In terms of muscles worked and the overall feel, it somewhat resembles the goblet squat or front squat."
    },
    {
        "title": "leg-curl-on-ball",
        "primary_muscles": [
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Glutes"
        ],
        "instructions": [
            "Lie flat on your back on the floor, with your arms by your sides for stability. Place your heels on top of an exercise ball with your legs straight.",
            "Keep your core braced and hips elevated, so that your body creates a straight line from feet to shoulders.",
            "Bend your knees to roll the ball towards your body, pulling your heels towards your glutes. Keep your hips lifted and your core engaged.",
            "Slowly straighten your legs, rolling the ball back to the starting position.",
            "Repeat for reps."
        ],
        "comments": "Leg curls are effective for strengthening the hamstrings and glutes. Using an exercise ball isn’t just a good alternative if you don’t have access to a leg curl machine; it also helps to improve your balance and core stability."
    },
    {
        "title": "leg-extension",
        "primary_muscles": [
            "Quads"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine so that you are correctly positioned. Your knees should be in line with the machine’s joint.",
            "Extend your knees with control, until they are completely straight.",
            "Slowly lower the weight again."
        ],
        "comments": ""
    },
    {
        "title": "leg-press",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Hamstrings"
        ],
        "instructions": [
            "Adjust the machine so that you only need to extend your legs slightly to be able to release the weights. Adjust the safety pins so that they catch the weight if you are unable to lift it.",
            "Place your feet on the platform, about shoulder-width apart.",
            "Inhale and lower the weight by bending your legs.",
            "Lower the weight as deep as possible without rounding your back and while keeping your glutes on the seat.",
            "Press the weight back up again as you exhale."
        ],
        "comments": ""
    },
    {
        "title": "lying-leg-curl",
        "primary_muscles": [
            "Hamstrings"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine so that you are correctly positioned. Your knees should be in line with the machine’s joint.",
            "Lift the weight by bending your knees as far as possible.",
            "Slowly lower the weight again."
        ],
        "comments": "The lying leg curl is an isolation exercise where it is easy to focus on the hamstrings."
    },
    {
        "title": "nordic-hamstring-eccentric",
        "primary_muscles": [
            "Hamstrings"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Start off standing on your knees with a straight hip. Feet wedged under something immovable, like a heavily loaded barbell, or a strong training partner.",
            "Lean your torso forward by extending your knees with no hip movement. In other words, do not push your butt backward.",
            "Control the eccentric movement by fighting the gravitational forces with all your hamstring strength. If possible, try keeping the eccentric phase to two seconds.",
            "When your chest reaches the floor, push yourself up using your arms and start over."
        ],
        "comments": "This exercise emphasizes eccentric hamstring strength and can help prevent injury while improving overall posterior chain stability."
    },
    {
        "title": "pause-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Place the bar on your upper back, inhale and brace your core slightly, and unrack the bar.",
            "Take two steps back, and adjust your foot position.",
            "Squat as deep as possible with good technique.",
            "Stop in the bottom position, and make a distinct pause.",
            "Stand up again. Exhale on the way up, or exchange air in the top position.",
            "Inhale and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "reverse-barbell-lunge",
        "primary_muscles": [
            "Adductors",
            "Quads",
            "Glutes"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Take a big step backward and sink as deep as possible in a lunge position, without hitting the knee of the back leg in the floor.",
            "Return to the starting position by pushing yourself back with the front leg."
        ],
        "comments": "The lunge is an exercise that not only strengthens your leg muscles, it can also be used to train your balance, coordination, and knee control. An alternative to using a barbell for external load is to hold weights (i.e., dumbbells or kettlebells) in your hands."
    },
    {
        "title": "romanian-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Get into the starting position by deadlifting a barbell off the floor, or by unracking it from a barbell rack.",
            "Inhale, brace your core slightly, and lean forward by hinging in your hips. Keep your knees almost completely extended.",
            "Lean forward as far as possible without rounding your back. You don’t have to touch the barbell to the floor, although it is OK if you do.",
            "Reverse the movement and return to the starting position. Exhale on the way up.",
            "Take another breath, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "safety-bar-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Grip the handles of a safety squat bar, and place the bar on your upper back.",
            "Inhale, brace your core slightly, and unrack the bar.",
            "Take two steps back, and adjust your foot position.",
            "Squat as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again.",
            "Exhale on the way up, or exchange air in the top position.",
            "Inhale and repeat for reps."
        ],
        "comments": "The safety bar squat is a variant of the classic barbell squat. The design of the bar means that the center of gravity of the weights ends up slightly further forward than they do in a barbell squat, which can make it easier to squat deep with good technique. By gripping handles instead of a straight bar, the requirement for mobility in the shoulders is also reduced somewhat."
    },
    {
        "title": "seated-leg-curl",
        "primary_muscles": [
            "Hamstrings"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine so that you are correctly positioned. Your knees should be in line with the machine’s joint.",
            "Push the weight down by bending your knees as far as possible.",
            "Slowly let the weight back again."
        ],
        "comments": ""
    },
    {
        "title": "shallow-lunges-bodyweight",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": [
            "Hamstrings"
        ],
        "instructions": [
            "Take a big step forward, and lower your body in a lunge position.",
            "Go as deep as your mobility allows, or where you want to reverse the movement.",
            "Lift your body by pressing the front leg away from the ground.",
            "Repeat for reps."
        ],
        "comments": "The lunge is a body weight exercise that not only strengthens your leg muscles, but it can also be used to train your balance, coordination and control. You can make the exercise heavier by holding weights in your hands."
    },
    {
        "title": "side-lunges-bodyweight",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Stand up straight with plenty of space to your side for you to step out.",
            "Lightly brace your core, and take a big step to the side.",
            "Go as deep as possible without your heel lifting from the ground and while maintaining control.",
            "Push yourself back up by pressing the foot from the ground.",
            "Repeat for reps."
        ],
        "comments": "Side lunges is a variant of the body weight lunge. The lunge is a body weight exercise that not only strengthens your leg muscles, but it can also be used to train your balance, coordination and control. Side lunges is an appropriate exercise to perform at home, since it is quite challenging even without extra weight. If you want to make it more challenging, you can add one or two dumbbells to your hands."
    },
    {
        "title": "smith-machine-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Step in with your feet directly below the bar, about shoulder width between your feet, and place the bar on your upper back.",
            "Inhale and brace your core slightly, and unrack the bar.",
            "Squat as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again.",
            "Exhale on the way up, or exchange air in the top position."
        ],
        "comments": "Smith machine squats differ from the free barbell squat primarily by its completely straight bar path, something that only happens in the free barbell squat when the bar is loaded with several times the lifter’s body weight. The fixed bar path lowers the requirements of balance and stabilization and might enable an increased focus on the muscles being trained."
    },
    {
        "title": "squat",
        "primary_muscles": [
            "Quads",
            "Adductors",
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Place the bar on your upper back. Inhale and brace your core slightly, and unrack the bar.",
            "Take two steps back, and adjust your foot position.",
            "Squat as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again.",
            "Exhale on the way up or exchange air in the top position.",
            "Inhale and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "step-up",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Stand in front of a chair, bench or something else that you can step up on.",
            "Place your foot on the chair.",
            "Lightly brace your core, and step up until your leg is straight.",
            "Lower yourself in a controlled motion.",
            "You can keep your foot at the chair, and repeat for reps."
        ],
        "comments": "Step-ups have been shown to activate gluteus maximus even more than squats and hip thrusts do.1 It is a great exercise to do at home, since it is challenging even without weights. If you train at home, you can step up on whatever furniture you have at hand – a chair, a stair step or a bench, for example."
    },
    {
        "title": "zercher-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Set a rack so that the barbell is just under the height of your elbow. Place the barbell in the crooks of your elbows.",
            "Back out from the rack, and brace your core.",
            "Descend by bending your knees, just in a regular squat.",
            "Go as deep as you can while keeping your back straight.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "zombie-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Place the barbell on the front of your shoulders, and keep your arms straight out in front of you.",
            "Breathe in, brace your core, and unrack the bar.",
            "Take a couple of steps back, and adjust your foot position.",
            "Squat as deep as possible with good technique.",
            "With control, reverse the movement, extending your hips and legs again. Breathe out on the way up, or exchange air in the top position.",
            "Repeat for reps."
        ],
        "comments": "Zombie squats are a variation of front squat where the barbell balances on the front of your shoulders by you keeping the arms out straight in front of you. This is an exercise where you should start with an empty barbell or just a wooden stick, and then increase the weight very carefully."
    },
    {
        "title": "assisted-chin-up",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with a supinated grip (palms facing you), about shoulder-width apart. Put your feet/knees on the pad and let your body weight push it down until you’re hanging with your arms extended.",
            "Keep your chest up, and look up at the bar.",
            "Inhale and pull yourself up until your chin is over the bar, or the bar touches your upper chest.",
            "Exhale and lower yourself with control until your arms are fully extended."
        ],
        "comments": "Chin-ups train both your lats and arm flexors effectively. With a supinated grip like in this exercise, you make it possible to focus even more on your arm flexors, if you want to."
    },
    {
        "title": "assisted-pull-up",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with a pronated grip (palms facing away from you), a little wider than shoulder-width apart. Put your feet/knees on the pad and let your body weight push it down until you’re hanging with your arms extended.",
            "Keep your chest up, and look up at the bar.",
            "Inhale and pull yourself up until your chin is over the bar or the bar touches your upper chest.",
            "Exhale and lower yourself with control until your arms are fully extended again."
        ],
        "comments": "Pull-ups train both your lats and arm flexors effectively. By using a grip slightly wider than shoulder-width, you get a good range of motion and high muscle activation in all the working muscles."
    },
    {
        "title": "back-extension",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Hamstrings"
        ],
        "instructions": [
            "First, adjust the machine: The top pad should be positioned against the top of your thighs.",
            "Step onto the machine and position yourself with your feet shoulder-width apart and your upper thighs against the top pad.",
            "Your upper body should be hanging off the edge of the machine, with your arms crossed over your chest or your hands behind your head.",
            "Hold a weight plate against your chest or a barbell across your shoulders if you want to use additional weight.",
            "Prepare to lift: Take a deep breath in, and as you exhale, engage your lower back muscles to lift your upper body until your body forms a straight line.",
            "Hold this position for a second, then inhale as you slowly lower your upper body back down to the starting position. Make sure to keep your movements slow and controlled, and don’t use momentum to swing your body up or down."
        ],
        "comments": ""
    },
    {
        "title": "banded-muscle-up",
        "primary_muscles": [
            "Chest",
            "Lats",
            "Triceps"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Front Deltoid",
            "Rear Deltoids",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Use a rubber band of self-selected resistance. The thicker the band, the easier it’ll be to get over the bar.",
            "Start with the band wrapped around one or both feet.",
            "Hang with straight elbows and a firm grip on the bar.",
            "Pull hard and use the assistance from the band to get through the transition part.",
            "Find a balanced position to land above the bar. It might help to make a stomach-to-bar contact.",
            "Finish with a press to locked elbows."
        ],
        "comments": ""
    },
    {
        "title": "barbell-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Lower Back",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Grip the bar with an overhand grip.",
            "Lean forward with the bar hanging from straight arms.",
            "Inhale and pull the bar towards you.",
            "Pull the bar as high as you can so that it touches your abs or chest, if possible.",
            "With control, lower the bar back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "barbell-shrug",
        "primary_muscles": [
            "Trapezius"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Hold a barbell in straight arms in front of your body.",
            "Lift your shoulders straight up as high as possible.",
            "Lower your shoulders again."
        ],
        "comments": "The shrug is an isolation exercise for the muscles that lifts and supports your shoulder girdle, like the top portion of your trapezius among others. Dumbbells, barbell, and trap bar are all common tools for this exercise."
    },
    {
        "title": "block-clean",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Adductors",
            "Quads"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors",
            "Calves"
        ],
        "instructions": [
            "Place the bar on blocks so that the bar is just above knee height.",
            "Grip the bar with an overhand grip, about shoulder-width apart.",
            "Hold your breath, and brace your core slightly.",
            "Lift the bar in a smooth but fast motion by extending your legs and knees simultaneously. Then squat down again to receive the bar on the front of your shoulders.",
            "Stand up on straight legs again.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The block clean is a variant of the clean exercise, in which you have removed the first pull from the floor. This makes it a potentially easier variant to begin with for learning the clean since you don’t have to focus on as many steps."
    },
    {
        "title": "block-snatch",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Adductors",
            "Quads"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Trapezius",
            "Calves",
            "Forearm Flexors"
        ],
        "instructions": [
            "Place a barbell on two blocks, so that it is resting just above knee height.",
            "Lean forward and grip the bar with a wide overhand grip.",
            "Inhale, and brace your core slightly.",
            "Lift the bar in a smooth but fast motion, by extending your legs and knees simultaneously.",
            "Once the bar has reached maximum speed, squat down deep and catch the bar on straight arms over your head.",
            "When you’ve got control of the bar, stand up straight.",
            "Lower the bar down to the blocks again, with control."
        ],
        "comments": "The block snatch is a variant of the snatch exercise, in which you have removed the first pull from the floor. This makes the block snatch a potentially easier variant to begin with for learning the snatch, since you don’t have to focus on as many steps."
    },
    {
        "title": "cable-close-grip-seated-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Attach a narrow handle to the cable row, and assume the starting position.",
            "Maintain an upright posture with your chest out, shoulders back, and core engaged. Lean forward slightly and let your scapulae move freely by letting them slide forward to the starting position.",
            "Inhale, retract your shoulder blades and pull the handle towards your lower abdomen while leaning back slightly.",
            "Exhale and slowly return to the starting position by extending your arms and leaning forward."
        ],
        "comments": ""
    },
    {
        "title": "cable-wide-grip-seated-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip a bar slightly wider than shoulder width and assume the starting position.",
            "Inhale and pull the handle towards your abdomen, while leaning back slightly.",
            "Exhale and slowly return to the starting position by extending your arms and leaning forward."
        ],
        "comments": "Lean forward slightly in the starting position, and lean back slightly in the end position. Let your scapulae move freely by letting them slide forward in the starting position, and pull them back in the end position."
    },
    {
        "title": "chin-up",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with a supinated grip (palms facing you), about shoulder-width apart.",
            "Keep your chest up, and look up at the bar.",
            "Inhale and pull yourself up until your chin is over the bar, or the bar touches your upper chest.",
            "Exhale and lower yourself with control until your arms are fully extended."
        ],
        "comments": "Chin-ups train both your lats and arm flexors effectively. With a supinated grip like in this exercise, you make it possible to focus even more on your arm flexors, if you want to."
    },
    {
        "title": "clean",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Adductors",
            "Quads"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors",
            "Calves"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot.",
            "Lean forward and grip the bar with an overhand grip, about shoulder-width apart.",
            "Hold your breath, and brace your core slightly.",
            "Lift the bar in a smooth but fast motion. Then squat down again to receive the bar on the front of your shoulders.",
            "Stand up on straight legs again.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The clean is an exercise that develops power and strength in your lower body, and it has long been a staple when it comes to complementary training for other sports."
    },
    {
        "title": "clean-and-jerk",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Adductors",
            "Quads",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors",
            "Triceps",
            "Lateral Deltoid",
            "Calves"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot.",
            "Lean forward and grip the bar with an overhand grip, about shoulder-width apart.",
            "Hold your breath, and brace your core slightly.",
            "Lift the bar in a smooth but fast motion. Then squat down again to receive the bar on the front of your shoulders. Stand up on straight legs again.",
            "Slightly bend your knees, and then forcefully extend them to push the bar up.",
            "Duck under the bar and catch it on straight arms, with your legs in a lunge position.",
            "First, take a step back with your front foot and then step forward with your back foot, until you’re standing with your feet side by side again, while controlling the bar on straight arms above your head.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The clean and jerk is a classic barbell exercise, and one of the competition lifts in weightlifting. As the name suggests, the exercise is composed of two separate lifts: the clean, in which you lift the bar from the floor to the front of the shoulders, and the jerk, in which you push the bar up to straight arms over your head. Both lifts are also commonly trained separately, and can be done with many variations."
    },
    {
        "title": "deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step up close to the bar so that it is about over the middle of your foot.",
            "Inhale, lean forward, and grip the bar.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Pull the bar close to your body, with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "deficit-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Stand on an elevation of optional height (i.e. a weight plate), and stand close to the bar, so that it is about over the middle of your foot.",
            "Inhale, lean forward, and grip the bar.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Pull the bar close to your body, with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "The deficit deadlift is a variant of the deadlift where you pull the bar standing on an elevation. This makes the lift harder due to more inefficient moment arms, and also increases the workload of the quadriceps."
    },
    {
        "title": "dumbbell-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Hold a dumbbell in each hand, and stand with your feet about hip-width apart.",
            "Inhale and lightly brace your core.",
            "Lower the dumbbells close to the floor, by leaning forward and bending your knees.",
            "Reverse the movement, and return to a standing position. Exhale on the way up."
        ],
        "comments": "The dumbbell deadlift is an exercise variant that differs from the traditional barbell deadlift in several ways. Two advantages of the dumbbell deadlift are that it is easy to learn, and you can drop the weights at any moment if you need to. That can make this exercise suitable for beginners, children och the elderly, for example. A disadvantage compared to the barbell deadlift is that it is difficult to use very heavy weights in this exercise, which means that you eventually might have difficulties increasing the load."
    },
    {
        "title": "dumbbell-row",
        "primary_muscles": "",
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Start by placing a dumbbell on the floor beside a bench or chair. Stand facing the bench or chair and place your left hand and left knee on top of it.",
            "Keep your back flat and parallel to the ground, with a slight bend in the standing leg. Grip the dumbbell with your right hand.",
            "Inhale and pull the dumbbell by driving the elbow toward the ceiling.",
            "With control, lower the dumbbell back to the starting position while exhaling.",
            "Complete desired reps on one side, then switch to the opposite arm and leg."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-shrug",
        "primary_muscles": [
            "Trapezius"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Hold a pair of dumbbells at your sides.",
            "Lift your shoulders straight up as high as possible.",
            "Lower your shoulders again."
        ],
        "comments": ""
    },
    {
        "title": "floor-back-extension",
        "primary_muscles": [
            "Lower Back"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Lie on the ground with your arms at about a 90-degree angle to your sides.",
            "Fix your eyes on the ground to keep the neck in a natural position.",
            "Lift your upper body by using your lower back. You may pause at the top of the movement, feeling the lower back muscles working.",
            "Lower your upper body in a slow and controlled motion.",
            "Repeat for reps."
        ],
        "comments": "Floor back extensions are a great exercise to do at home since it does not require any equipment. It could also serve as a warmup exercise if you want to activate your lower back."
    },
    {
        "title": "good-morning",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Adductors"
        ],
        "instructions": [
            "Place the bar on your upper back. Inhale and brace your core slightly, and unrack the bar.",
            "Take two steps back, and place your feet slightly wider than hip-width.",
            "Inhale and hold your breath, and lean forward by hinging your hips. Imagine that you are trying to push your butt back as far as possible.",
            "Lean forward as far as you can with a straight back, and without the bar rolling forward.",
            "Your knees will bend slightly, but most of the movement takes place in the hips.",
            "With control, stop and reverse the movement, extending your hips again while exhaling.",
            "At the top, inhale and repeat for reps."
        ],
        "comments": "The good morning is an exercise that trains your core effectively. Many use it as an assistance exercise for the squat and the deadlift."
    },
    {
        "title": "hang-clean",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Adductors",
            "Quads"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors",
            "Calves"
        ],
        "instructions": [
            "Grip the bar with an overhand grip, about shoulder-width apart, and lift it up to get into the starting position.",
            "Hold your breath, and brace your core slightly.",
            "Lower the bar along your thighs, down to about knee-level, by bending your hips and knees.",
            "Reverse the movement, and lift the bar in a smooth but fast motion by extending your legs and knees simultaneously. Then squat down again to receive the bar on the front of your shoulders.",
            "Stand up on straight legs again.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The hang clean is a variant of the clean exercise, in which you have removed the first pull from the floor. This makes the hang clean a potentially easier variant to begin with for learning the clean, since you don’t have to focus on as many steps."
    },
    {
        "title": "hang-power-clean",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Adductors",
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Grip the bar with an overhand grip, about shoulder-width apart, and lift it up to get into the starting position.",
            "Hold your breath, and brace your core slightly.",
            "Lower the bar along your thighs, down to about knee-level, by bending your hips and knees.",
            "Reverse the movement, and lift the bar in a smooth but fast motion by extending your legs and knees simultaneously.",
            "Bend your knees slightly and receive the bar on the front of your shoulders.",
            "Stand up on straight legs again.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The hang power clean is a variant of the clean exercise, in which you have removed the first pull from the floor, and you also don’t catch the bar in as deep of a squat position. This makes the hang power clean a potentially easier variant to begin with for learning the clean, since you don’t have to focus on as many steps, and also the mobility demands are not as high."
    },
    {
        "title": "hang-power-snatch",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Adductors",
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Grip the bar with a wide overhand grip, and lift it up to get into the starting position, with the bar resting in the hip crease.",
            "Hold your breath, and brace your core slightly.",
            "Lower the bar along your thighs, down to about knee-level, by bending your hips and knees.",
            "Reverse the movement, and lift the bar in a smooth but fast motion, by extending your legs and knees simultaneously.",
            "Once the bar has reached maximum speed, bend your knees slightly and catch the bar on straight arms over your head.",
            "When you’ve got control of the bar, stand up straight.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The hang power snatch is a variant of the snatch exercise, in which you have removed the first pull from the floor, and you also don’t catch the bar in as deep of a squat position. This makes the hang power snatch a potentially easier variant to begin with for learning the snatch, since you don’t have to focus on as many steps, and also the mobility demands are not as high."
    },
    {
        "title": "hang-snatch",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Adductors",
            "Quads"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors",
            "Calves"
        ],
        "instructions": [
            "Grip the bar with a wide overhand grip and lift it up to get into the starting position, with the bar resting in the hip crease.",
            "Hold your breath and brace your core slightly.",
            "Lower the bar along your thighs, down to about knee-level, by bending your hips and knees.",
            "Reverse the movement and lift the bar in a smooth but fast motion, by extending your legs and knees simultaneously.",
            "Once the bar has reached maximum speed, squat down deep and catch the bar on straight arms over your head.",
            "When you’ve got control of the bar, stand up straight.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The hang snatch is a variant of the snatch exercise, in which you have removed the first pull from the floor. This makes the hang snatch a potentially easier variant to begin with for learning the snatch, since you don’t have to focus on as many steps."
    },
    {
        "title": "inverted-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Place a barbell in a rack, high enough for you to be able to hang below it in straight arms, with your heels on the floor.",
            "Grip the bar with an overhand grip, slightly wider than shoulder-width apart.",
            "Inhale, and pull yourself up as high as you can, or until your chest touches the bar.",
            "Exhale, while lowering yourself back to the starting position with control."
        ],
        "comments": "The inverted row is a pulling exercise where you use your own bodyweight as resistance. You can make the exercise heavier by placing your feet on an elevation, or easier by raising the bar to a higher rack position."
    },
    {
        "title": "inverted-row-with-underhand-grip",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Place a barbell in a rack, high enough for you to be able to hang below it in straight arms, with your heels on the floor.",
            "Grip the bar with an underhand grip, about shoulder-width apart.",
            "Inhale, and pull yourself up as high as you can, or until your chest touches the bar.",
            "Exhale, while lowering yourself back to the starting position with control."
        ],
        "comments": "The inverted row is a pulling exercise where you use your own bodyweight as resistance. You can make the exercise heavier by placing your feet on an elevation, or easier by raising the bar to a higher rack position."
    },
    {
        "title": "jefferson-curl",
        "primary_muscles": [
            "Lower Back"
        ],
        "secondary_muscles": [
            "Adductors",
            "Glutes",
            "Hamstrings",
            "Trapezius"
        ],
        "instructions": [
            "Stand tall with a light barbell or other weight in your hands. For extra range of motion, you might want to stand on a small block.",
            "Bend forward by tucking your chin into your chest and then slowly and deliberately start to round your spine, vertebrae by vertebrae, starting from the neck and moving down towards the lower back.",
            "As you round your spine, allow the barbell to lower towards the ground, keeping it close to your body. Go as low as your flexibility allows, but don’t force it. You should feel a stretch but not pain.",
            "Once you’ve reached the lowest point that you can comfortably go, pause for a moment.",
            "Start uncurling your spine, beginning from the lower back and working your way up to your neck until you have returned to the starting position."
        ],
        "comments": "The Jefferson curl is more of a mobility exercise than a strength training exercise, although it will strengthen your spinal erectors."
    },
    {
        "title": "jumping-muscle-up",
        "primary_muscles": [
            "Chest",
            "Lats",
            "Triceps"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Front Deltoid",
            "Rear Deltoids",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Use a box of self-selected height.",
            "Start on top of the box with bent knees and straight arms/elbows. Keep a firm grip on the rings.",
            "Jump hard simultaneously as you pull yourself up to get through the transition part and into the bottom of the dip.",
            "Find a balanced and secure position to land at the bottom of the dip. Try to squeeze the rings against your body (torso or stomach) before continuing the movement with the finishing dip press."
        ],
        "comments": ""
    },
    {
        "title": "kettlebell-swing",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Place a kettlebell on the ground, about one or two feet in front of you.",
            "Take a wide stance, lean forward and grip the kettlebell.",
            "Brace your core slightly, and swing the kettlebell back between your legs, while inhaling.",
            "Swing the kettlebell forward by extending your hip, while exhaling.",
            "Try to swing the kettlebell to about chest height.",
            "Repeat for reps and put the kettlebell back on the ground when you’re finished."
        ],
        "comments": "Remember that it is the power from your hip and back that lifts the kettlebell, not your arms. The kettlebell swing is primarily an exercise for your glutes, back, and posterior thighs, and therefore you shouldn’t bend your knees more than just slightly. If you want to train your quads (front of the thigh) with a kettlebell, then goblet squats or front squats are a better alternative."
    },
    {
        "title": "lat-pulldown-with-pronated-grip",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Begin by adjusting the thigh pad to fit snugly against your thighs to prevent your body from lifting off the seat.",
            "Grasp the bar with an overhand (pronated) grip, with your hands slightly wider than shoulder-width apart.",
            "Sit with your thighs under the thigh pad, keep your chest up, and look at the bar.",
            "Pull the bar down towards your chest, leading with your elbows.  Pull until the bar is below your chin or touches your upper chest.",
            "Squeeze your shoulder blades together at the bottom of the movement.",
            "Exhale and slowly release the bar back up to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "lat-pulldown-with-supinated-grip",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with a supinated grip (palms facing you), about shoulder-width apart.",
            "Sit down with your thighs under the leg support, keep your chest up, and look up at the bar.",
            "Inhale and pull the bar towards you.",
            "Pull the bar down until it is below your chin or touches your upper chest.",
            "Exhale and slowly return the bar until your arms are fully extended."
        ],
        "comments": "Lat pulldowns train both your lats and arm flexors effectively. Common variations of this exercise includes gripping the bar with a pronated (overhand) grip. Another common variation is to use a one-handed grip and train one side at a time, which enables you to focus more on each sides muscles in turn."
    },
    {
        "title": "bar-muscle-up",
        "primary_muscles": [
            "Chest",
            "Lats",
            "Triceps"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Front Deltoid",
            "Rear Deltoids",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with a false grip (your wrists flexed and your knuckles above the bar).",
            "Initiate the movement by powerfully pulling the bar toward your stomach.",
            "When you reach the transition point between pulling and pushing, lean forward so the bar connects with your stomach.",
            "Finish the movement by extending your elbows to lock out at the top."
        ],
        "comments": ""
    },
    {
        "title": "ring-muscle-up",
        "primary_muscles": [
            "Chest",
            "Lats",
            "Triceps"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Front Deltoid",
            "Rear Deltoids",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the rings with a false grip (Your wrists flexed, and your knuckles through the rings).",
            "Initiate the movement by powerfully pulling the rings to your chest or armpits.",
            "When you reach the transition point between pulling and pushing, lean forward as you simultaneously turn the rings outwards while keeping the rings close to your armpits.",
            "When the rings have turned 180 degrees, you should now find yourself above the rings, in a bottom dip position.",
            "From here, press yourself to the top of the dip with extended elbows."
        ],
        "comments": ""
    },
    {
        "title": "one-handed-cable-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grab the handle and assume the starting position.",
            "Inhale and pull the handle towards the side of your abdomen, while leaning back slightly.",
            "Exhale and slowly return to the starting position by extending your arm and leaning forward."
        ],
        "comments": "Lean forward slightly in the starting position, and lean back slightly in the end position. Let your scapula move freely by letting it slide forward in the starting position, and pull it back in the end position."
    },
    {
        "title": "one-handed-lat-pulldown",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Sit down with your thighs under the leg support, grasp the handle with one hand, keep your chest up, and look slightly up.",
            "Inhale and pull the handle towards your side.",
            "Exhale and slowly return the handle until your arm is extended again."
        ],
        "comments": "Lat pulldowns train both your lats and arm flexors effectively. By training one side at a time, you are enabled to focus more on each sides muscles in turn."
    },
    {
        "title": "pause-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot.",
            "Inhale, lean forward, and grip the bar.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Pause the movement when the bar is just a few inches above the floor.",
            "After a pause of a second or two, complete the lift by pulling the bar close to your body, until fully extended.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "pendlay-row",
        "primary_muscles": "",
        "secondary_muscles": [
            "Biceps",
            "Lower Back",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Lean forward by hinging in your hip, and grip a bar with an overhand grip.",
            "Pull the bar towards you, without otherwise moving your upper body. Pull the bar as high as you can, so that it touches your abs or chest if possible.",
            "With control, lower the bar back to the floor."
        ],
        "comments": "The pendlay row is a variant of the barbell row where you keep your upper body fixated throughout the movement. Only the bar and your arms are moving, and you put the bar back on the floor between each repetition. This means that you will avoid some of the static work for your core and lower back that you otherwise get from doing barbell rows. Instead, you will get to practice how to build up tension in those muscles in each rep."
    },
    {
        "title": "power-clean",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Adductors",
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot.",
            "Lean forward and grip the bar with an overhand grip, about shoulder-width apart.",
            "Hold your breath, and brace your core slightly.",
            "Lift the bar in a smooth but fast motion. Bend your knees slightly and receive the bar on the front of your shoulders.",
            "Stand up on straight legs again.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The power clean is a variant of the clean, where you catch the bar at a higher position. Because you’re not catching the bar in such a deep squat position, many find this exercise technically easier to perform. A disadvantage, however, is that you’re not able to lift as much weight in the power clean as in the clean, since you have to lift the bar even higher, because of the higher catch position."
    },
    {
        "title": "power-snatch",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Adductors",
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot.",
            "Lean forward and grip the bar with a wide overhand grip, close to the weight plates.",
            "Hold your breath, brace your core slightly, and lower your hip closer to the floor.",
            "Lift the bar in a smooth but fast motion, by extending your legs and knees simultaneously.",
            "Once the bar has reached maximum speed, bend your knees slightly and catch the bar on straight arms over your head.",
            "When you’ve got control of the bar, stand up straight.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The power snatch is a variant of the snatch, where you catch the bar in a higher position. Because you’re not catching the bar in such a deep squat position, many find this exercise technically easier to perform. A disadvantage, however, is that you’re not able to lift as much weight in the power snatch as in the snatch, since you have to lift the bar even higher, because of the higher catch position."
    },
    {
        "title": "pull-up",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with palms facing away from you, slightly wider than shoulder-width.",
            "Keep your chest up, and look up at the bar.",
            "Inhale and pull yourself up until your chin is over the bar or the bar touches your upper chest.",
            "Exhale and lower yourself with control until your arms are fully extended."
        ],
        "comments": "Pull-ups train both your lats and arm flexors effectively. By using a grip slightly wider than shoulder-width, you get a good range of motion and high muscle activation in all the working muscles."
    },
    {
        "title": "pull-ups-with-a-neutral-grip",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with a neutral grip (palms facing each other), about shoulder-width apart.",
            "Keep your chest up, and look up at the bar.",
            "Inhale and pull yourself up until your chin is over the bar or the bar touches your upper chest.",
            "Exhale and lower yourself with control until your arms are fully extended."
        ],
        "comments": "Chin-ups train both your lats and arm flexors effectively. With a neutral grip like in this exercise, you make it possible to focus even more on your arm flexors if you want to."
    },
    {
        "title": "rack-pull",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Set the bar at desired height, using a rack or blocks.",
            "Step up close to the bar, so that it is over the middle of your foot.",
            "Inhale, lean forward and bend your knees slightly, and grip the bar.",
            "Hold your breath, brace your core, and lift the bar.",
            "Pull the bar close to your body with a straight back, until you are standing straight.",
            "Lower the bar back to the rack or blocks with control."
        ],
        "comments": ""
    },
    {
        "title": "ring-pull-up",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Adjust the rings to a height where you can hang with fully extended arms without your feet touching the ground.",
            "Grab the rings and hang with your body straight and core engaged.",
            "Pull yourself up by driving your elbows down and back, bringing your chest to or above the rings.",
            "Slowly extend your arms to lower yourself back to the starting position.",
            "Repeat for reps."
        ],
        "comments": "The ring pull-up is a variation of pull-ups which is great for strengthening your pulling muscles and for preparing you on the road to conquering the muscle-up."
    },
    {
        "title": "ring-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Adjust the gymnastic rings to your desired height and grip the rings while facing the anchor point.",
            "Lean back with your arms extended and walk your feet forward until your body is at an angle, keeping a straight line from head to heels.",
            "Pull your chest towards the rings by driving your elbows back, keeping your body straight and core engaged.",
            "Slowly extend your arms to lower yourself back to the starting position.",
            "Repeat for reps."
        ],
        "comments": "The ring row is a great exercise for strengthening your pulling muscles and for preparing you on the road to conquering the muscle-up."
    },
    {
        "title": "scap-pull-up",
        "primary_muscles": [
            "Rotator Cuff",
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grip the bar with a pronated grip (palms facing away from you), slightly wider than shoulder width.",
            "Inhale and pull your shoulder blades down and together by activating the muscles in your back. Pull your shoulders away from your ears.",
            "Exhale, relax the shoulder blades and let them come up again."
        ],
        "comments": "Scap pull-ups mimics the first part of a pull-up, and can be a useful exercise for learning what muscles you need to use in a pull-up."
    },
    {
        "title": "seal-row",
        "primary_muscles": "",
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Lie on your stomach on a bench, with a barbell placed on the floor below you.",
            "Grip the bar with an overhand grip, slightly wider than shoulder-width.",
            "Inhale and pull the bar towards you.",
            "Pull the bar as high as you can, so that it touches the underside of the bench if possible.",
            "With control, lower the bar back to the starting position."
        ],
        "comments": "The seal row is a variation of the barbell row, where you isolate the work to the rowing muscles in the arms and the back. This is done by lying on a bench and thus off-loading the legs and the core. By isolating the work in this way, it can be easier to focus on and exhaust the trained muscles."
    },
    {
        "title": "seated-machine-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Adjust the machine to the correct settings and sit down in the starting position.",
            "Inhale and pull the handles towards you, as far as possible.",
            "Exhale and slowly return the handles to the starting position again."
        ],
        "comments": "Machine row is a stable exercise for your pulling muscles, which means that you don’t have to think about balance or trajectory, but can focus on getting contact with the right muscles."
    },
    {
        "title": "snatch",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Adductors",
            "Quads"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Trapezius",
            "Forearm Flexors",
            "Calves"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot.",
            "Lean forward and grip the bar with a wide overhand grip, close to the weight plates.",
            "Hold your breath, brace your core slightly, and lower your hip closer to the floor.",
            "Lift the bar in a smooth but fast motion, by extending your legs and knees simultaneously.",
            "Once the bar has reached maximum speed, squat down deep and catch the bar on straight arms over your head.",
            "When you’ve got control of the bar, stand up straight.",
            "Lower the bar in front of you, with control."
        ],
        "comments": "The snatch is a classic barbell exercise, and also one of the competition lifts in weightlifting. Snatch develops your explosive strength (power) in the lower body, since you need to get the bar moving so fast in such a short amount of time, that it comes high enough for you to catch it."
    },
    {
        "title": "snatch-grip-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot.",
            "Inhale, lean forward and take a wide grip, like in a snatch.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Pull the bar close to your body, with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "Snatch grip deadlifts, as the name states, is a variant of the regular deadlift where you take a much wider grip – the same as in a snatch. The wider grip means you will have to lean forward and bend your hips, knees and ankles more to reach the bar. Your upper back muscles will also have to work harder to stabilize your shoulders."
    },
    {
        "title": "stiff-legged-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot. Keep your feet shoulder-width apart.",
            "Inhale, lean forward with only a slight bend in your knees, and grip the bar.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Pull the bar close to your body, with a straight back, until you have reached a standing position.",
            "Lower the bar back to the ground with control, still keeping your legs straight.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "The stiff-leg deadlift (or straight-leg deadlift) is a variation of the traditional deadlift, where you have almost entirely shifted the work to your posterior chain."
    },
    {
        "title": "straight-arm-lat-pulldown",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Rear Deltoids",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with a pronated grip (palms facing away from you), slightly wider than shoulder-width.",
            "With straight arms, push the bar down in front of you by contracting your lats.",
            "Slowly return the bar to the starting position."
        ],
        "comments": "The straight arm lat pulldown is an exercise that isolates the work to your lats and other muscles that pull your upper arm closer to your body. For a longer range of motion and better muscle contact, you could try to lean slightly forward and bend your knees."
    },
    {
        "title": "sumo-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step up close to the bar with wide foot placement. A good starting point is to have the bar over the middle of your foot and stand so wide that your shins are vertical, as seen from the front.",
            "Inhale, bend down and grip the bar.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Pull the bar close to your body, with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "The deadlift is a classic exercise that trains almost your entire body and a competitive event in the sport of powerlifting. This exercise requires great core stability and control, and you should strive to keep your spine straight (neutral) during the entire lift. It is a good idea to experiment with different foot placements to determine which lifting technique suits your body best."
    },
    {
        "title": "t-bar-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Lower Back",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Stand on the plate, lean forward, and grasp the bar with an overhand grip in straight arms.",
            "Inhale and pull the bar towards you as high as possible.",
            "With control, lower the bar back to the starting position."
        ],
        "comments": "T-bar rows is a variant of standing rows where the weight and bar path is fixed. That lessens the requirements of balance and stabilization, and can make it easier to focus on the muscles being trained."
    },
    {
        "title": "trap-bar-deadlift-with-high-handles",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Quads"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step into the bar’s opening, and position yourself so that the handles are in line with the middle of your feet.",
            "Inhale, bend down and grip the handles.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Lift the bar with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "The trap bar deadlift is a variant of the classic deadlift with a straight bar. By using a trap bar, you will distribute the workload more evenly between hip and knee extensors, which means that your quads will get more work from deadlifts with a trap bar than with a straight bar. Because of more beneficial moment arms, most people are slightly stronger in trap bar deadlifts compared to straight bar deadlifts."
    },
    {
        "title": "trap-bar-deadlift-with-low-handles",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Quads"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step into the bar’s opening and position yourself so that the handles are in line with the middle of your feet.",
            "Inhale, bend down and grip the handles.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Lift the bar with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "The trap bar deadlift is a variant of the classic deadlift with a straight bar. By using a trap bar, you will distribute the workload more evenly between hip and knee extensors, which means that your quads will get more work from deadlifts with a trap bar than with a straight bar. Because of more beneficial moment arms, most people are slightly stronger in trap bar deadlifts compared to straight bar deadlifts."
    },
    {
        "title": "banded-side-kick",
        "primary_muscles": [
            "Abductors"
        ],
        "secondary_muscles": [
            "Glutes"
        ],
        "instructions": [
            "Place an elastic band around your ankles. Hold on to something with your hands for balance.",
            "Stand on one leg, while bringing your other leg as far out to the side as possible.",
            "Bring the leg back in while resisting the band."
        ],
        "comments": "Banded side kicks train the muscles that abduct (moves apart) your thighs, like your gluteus medius and parts of gluteus maximus."
    },
    {
        "title": "cable-pull-through",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Lower Back",
            "Hamstrings",
            "Adductors"
        ],
        "instructions": [
            "Fasten a rope handle in the lower position on a cable pulley. Turn your back against the pulley, with the cable between your thights, and take a few steps forward.",
            "Bend forward by hinging in your hips, and let the rope handle move backwards between your thighs.",
            "Extend your hip again, and return to standing."
        ],
        "comments": "This exercise isolates the muscles that extend your hips, primarily the glutes. Because the direction of resistance comes from behind you, you won’t get the same rest in the top position that you often get with free weights. This means that your glutes will be under more constant tension, which might be beneficial for muscle growth."
    },
    {
        "title": "clamshells",
        "primary_muscles": [
            "Abductors"
        ],
        "secondary_muscles": [
            "Glutes"
        ],
        "instructions": [
            "Lie on your side, with your legs bent at about a 90-degree angle.",
            "Tuck your pelvis in to properly activate your glutes.",
            "Lightly brace your core and lift the upper leg by using your glutes. Lift as high as you can while maintaining contact with the glute muscles.",
            "Lower the leg in a slow and controlled motion, and repeat for reps."
        ],
        "comments": "Clamshells are commonly used to activate the abductors. They can be made more challenging by putting a band over your knees.   Focus on contact with the glutes through the entire movement!"
    },
    {
        "title": "death-march-with-dumbbells",
        "primary_muscles": [
            "Glutes",
            "Hamstrings",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Adductors",
            "Forearm Flexors",
            "Trapezius"
        ],
        "instructions": [
            "Stand upright with your feet hip-width apart, holding a dumbbell in each hand by your sides.",
            "Take a short step forward with one leg, keeping both legs almost straight with a slight bend in the knees.",
            "Hinge at the hips and lower your torso until you feel a stretch in the hamstrings. Remember to keep tension in your core, and keep your back straight.",
            "Push back up to standing and take the next step forward with the opposite leg.",
            "Repeat the movement, alternating legs with each step."
        ],
        "comments": "The death march targets the hamstrings and glutes, helping to strengthen them while also improving hip mobility."
    },
    {
        "title": "dumbbell-romanian-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Stand upright holding a pair of dumbbells.",
            "Inhale, brace your core slightly, and lean forward by hinging in your hips. Keep your knees almost completely extended.",
            "Lean forward as far as possible without rounding your back. You don’t have to touch the dumbbells to the floor, although it is OK if you do.",
            "Reverse the movement and return to the starting position. Exhale on the way up.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "The dumbbell Romanian deadlift is a variation of the traditional deadlift, where you have almost entirely shifted the work to your posterior chain."
    },
    {
        "title": "dumbbell-frog-pumps",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Adductors"
        ],
        "instructions": [
            "Lie on your back and bring the soles of your feet together into a frog position, try to bring your feet as close to your butt as possible. Place a dumbbell on your hips.",
            "Make sure to keep your core activated, and the lower back and shoulders pressed down on the floor before starting the movement.",
            "Press your feet down into the floor and squeeze your glutes to thrust your hips upwards.",
            "Pause at the top and then reverse the movement. Make sure to do the entire movement slow and controlled."
        ],
        "comments": "The frog pump is a glute exercise that requires no equipment, making it good for home workouts. It can also be used as a warm-up exercise. It’s up to you whether you want to make or avoid eye contact with other people while doing frog pumps."
    },
    {
        "title": "fire-hydrants",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand on all fours, with your gaze on the floor.",
            "Lightly brace your core and lift your leg to the side by using your glute muscles. Lift your leg as high as possible while maintaining contact with your glutes.",
            "Slowly lower your leg and repeat for reps."
        ],
        "comments": "Fire hydrants is a suitable exercise to do at home, since it does not require any equipment. It can also be used to activate the glutes before a workout. If you want to make it more challenging, you can add a band around your knees or an ankle weight to your leg."
    },
    {
        "title": "frog-pumps",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Hamstrings",
            "Adductors"
        ],
        "instructions": [
            "Lie on your back and bring the soles of your feet together into a frog position, try to bring your feet as close to your butt as possible.",
            "Make sure to keep your core activated, and the lower back and shoulders pressed down on the floor before starting the movement.",
            "Press your feet down into the floor and squeeze your glutes to thrust your hips upwards.",
            "Pause at the top and then reverse the movement. Make sure to do the entire movement slow and controlled."
        ],
        "comments": "The frog pump is a glute exercise that requires no equipment, making it good for home workouts. It can also be used as a warm-up exercise. It’s up to you whether you want to make or avoid eye contact with other people while doing frog pumps."
    },
    {
        "title": "glute-bridge",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Quads"
        ],
        "instructions": [
            "Lie down with your feet on the floor.",
            "Tuck the pelvis in to properly activate the glutes.",
            "Push your hips towards the ceiling by using your glutes, until your body forms a straight line from head to knees.",
            "Squeeze your glutes at the top.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": "The glute bridge is a great exercise to activate the glutes. It can serve as a warmup or activation exercise, or be incorporated into your workout. You can make it more challenging by putting a band around your knees or adding a weight on your hips, or by using only one leg (one-legged glute bridge)."
    },
    {
        "title": "hip-abduction-against-band",
        "primary_muscles": [
            "Abductors"
        ],
        "secondary_muscles": [
            "Glutes"
        ],
        "instructions": [
            "Sit down on a bench with an elastic band around your knees, and your feet about hip width apart.",
            "Move your legs apart as far as possible, against the band.",
            "Return with control to the starting position."
        ],
        "comments": "Hip abduction against band trains the muscles that abduct (spreads) your thighs, like your gluteus medius and parts of gluteus maximus."
    },
    {
        "title": "hip-abduction-machine",
        "primary_muscles": [
            "Abductors"
        ],
        "secondary_muscles": [
            "Glutes"
        ],
        "instructions": [
            "Adjust the machine to the appropriate settings, sit down, and grip the handles.",
            "Push the pads out by moving your legs apart as far as possible.",
            "Return with control to the starting position."
        ],
        "comments": "The hip abduction machine trains the muscles that abducts (moves apart) your thighs, like your gluteus medius and parts of gluteus maximus."
    },
    {
        "title": "hip-thrust",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Adductors",
            "Quads"
        ],
        "instructions": [
            "Sit on the floor with your back against a sturdy bench.",
            "Roll the barbell up over your thighs, until it is placed over your hips.",
            "Place your feet on the floor, about shoulder-width apart, with bent knees.",
            "Place your hands on the bar to stabilize it.",
            "Push the bar towards the ceiling by extending your hips. Your knees should form a ~90 degree angle at the top.",
            "Lower the weight and repeat for reps."
        ],
        "comments": "The hip thrust is an isolation exercise for your hip extensors, particularly your glutes. The exercise can be varied by using either one or two legs, by elevating your feet for a longer range of motion, or by adding an elastic band between your knees to train your hip abductors simultaneously."
    },
    {
        "title": "hip-thrust-machine",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Adductors",
            "Quads"
        ],
        "instructions": [
            "Adjust the machine and get in position.",
            "Push the pad towards the ceiling by extending your hips.",
            "Lower the weight and repeat for reps."
        ],
        "comments": "The hip thrust is an isolation exercise for your hip extensors, particularly your glutes. The exercise can be varied by using either one or two legs."
    },
    {
        "title": "hip-thrust-with-band-around-knees",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Adductors",
            "Abductors",
            "Quads"
        ],
        "instructions": [
            "Sit on the floor with your back against a sturdy bench.",
            "Place an elastic band around your knees, just below them.",
            "Roll the barbell up over your thighs, until it is placed over your hips.",
            "Place your feet on the floor, about shoulder width apart, with bent knees.",
            "Place your hands on the bar to stabilize it.",
            "Push the bar towards the ceiling by extending your hips. Your knees should form a ~90 degree angle at the top.",
            "Lower the weight and repeat for reps."
        ],
        "comments": "The hip thrust is an isolation exercise for your hip extensors, particularly your glutes. By placing an elastic band around your knees, you increase the load on your hip adductors, i.e. your gluteus medius."
    },
    {
        "title": "lateral-walk-with-band",
        "primary_muscles": [
            "Abductors"
        ],
        "secondary_muscles": [
            "Glutes"
        ],
        "instructions": [
            "Place an elastic band around your ankles.",
            "Walk sideways, so that you have to bring your leg out against the band’s resistance.",
            "Choose for yourself if you want to change direction after every step, or if you for example want to walk ten steps in one direction followed by ten steps in the other direction."
        ],
        "comments": "Lateral walk with band trains the muscles that abduct (moves apart) your thighs, like your gluteus medius and parts of gluteus maximus."
    },
    {
        "title": "machine-glute-kickbacks",
        "primary_muscles": "",
        "secondary_muscles": [
            "Hamstrings",
            "Adductors"
        ],
        "instructions": [
            "Adjust the machine to your body. The knees should be facing forward and resting near the bottom of the padding. Place your forearms on the upper padding and grip the handles.",
            "Next, make sure that you have the arm of the machine under your knee. Brace your core, keep your body still, and start to press your leg backwards and upwards by activating the glute.",
            "Push the leg as far up as you can without rotating in the hips, then return to the starting position.",
            "Do all reps on one side first, and then switch to the other leg."
        ],
        "comments": "The Machine Glute Kickback is an alternative to the bodyweight kickback, when you feel like you want to add some more weight."
    },
    {
        "title": "one-legged-glute-bridge",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Adductors",
            "Abductors",
            "Quads"
        ],
        "instructions": [
            "Lie down with one foot on the floor, one leg extended.",
            "Tuck the pelvis in to properly activate the glutes.",
            "Push your hips towards the ceiling by using the glute muscle in the bent leg, until your body forms a straight line from head to foot.",
            "Squeeze your glutes at the top.",
            "Reverse the movement, and repeat for reps."
        ],
        "comments": "The glute bridge is a great exercise to activate the glutes. It can serve as a warmup or activation exercise, or be incorporated into your workout. This variant of the glute bridge trains one leg at a time, making it more difficult. You can make it even more challenging by adding a weight on your hips. It is appropriate for performing at home, since it can be quite heavy even without extra weight."
    },
    {
        "title": "one-legged-hip-thrust",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Adductors",
            "Abductors",
            "Quads"
        ],
        "instructions": [
            "Lean your back against a chair, sofa, bench or whatever furniture you have at hand.",
            "Place one feet on the floor and lift the other leg.",
            "Push your hips towards the ceiling, using your glute muscle in the leg that touches the floor. The working leg should form a ~90-degree angle at the top position.",
            "Lower the hips and repeat for reps."
        ],
        "comments": "The hip thrust is an isolation exercise for your hip extensors, particularly your glutes. This is a variant of the regular hip thrust where you only use one leg. You can vary the exercise by elevating your foot for a longer range of motion, or add a weight on your hips."
    },
    {
        "title": "reverse-hyperextension",
        "primary_muscles": [
            "Glutes",
            "Hamstrings",
            "Lower back"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Position yourself on a reverse hyperextension machine, lying face down with your hips at the edge of the pad and your legs hanging down. Hold on to the handles or sides for stability.",
            "Keep your legs hanging down towards the floor, straight and relaxed. Your feet should be together.",
            "Brace your core, and maintain a neutral back throughout the movement.",
            "Lift your legs upward until they are in line with your body or slightly above by using your glutes and lower back muscles. Do the movement slowly and controlled.",
            "At the top of the movement, squeeze your glutes and hold for a moment.",
            "Slowly reverse the movement back to the starting position while maintaining control and keeping tension in your muscles.",
            "Repeat for reps."
        ],
        "comments": "Reverse hyperextensions can be a good alternative for those looking to strengthen the lower back and glutes with reduced spinal loading, rehabilitate lower back injuries, or add variety to posterior chain training without the need for heavy lifting."
    },
    {
        "title": "romanian-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Get into the starting position by deadlifting a barbell off the floor, or by unracking it from a barbell rack.",
            "Inhale, brace your core slightly, and lean forward by hinging in your hips. Keep your knees almost completely extended.",
            "Lean forward as far as possible without rounding your back. You don’t have to touch the barbell to the floor, although it is OK if you do.",
            "Reverse the movement and return to the starting position. Exhale on the way up.",
            "Take another breath, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "single-leg-romanian-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Stand upright and hold the bar with your hands about shoulder-width apart.",
            "Brace your core, and lift one leg off the ground.",
            "Keep the back straight and start to lean forward by hinging at the hips. Lower until you feel a stretch in the standing leg’s hamstring. Make sure to keep your hips still, you don’t want the side with your lifted leg to start rotating upwards.",
            "Return to the starting position. Finish all your reps on one side first, and then repeat on the other leg."
        ],
        "comments": "The Single Leg Romanian Deadlift is a challenging exercise for your hamstrings and glutes as well as for your balance and coordination. If you have trouble keeping your balance, you can keep the toes of your lifted leg touching the floor to add some stability."
    },
    {
        "title": "standing-glute-kickback-in-machine",
        "primary_muscles": "",
        "secondary_muscles": [
            "Hamstrings",
            "Adductors"
        ],
        "instructions": [
            "Adjust the machine to your body. The knees should be facing forward and resting near the bottom of the padding. Place your forearms on the upper padding and grip the handles.",
            "Next, make sure that you have the arm of the machine under your knee. Brace your core, keep your body still, and start to press your leg backwards and upwards by activating the glute.",
            "Push the leg as far up as you can without rotating in the hips, then return to the starting position.",
            "Do all reps on one side first, and then switch to the other leg."
        ],
        "comments": "The Standind Glute Kickback in Machine is an alternative to the bodyweight kickback, when you feel like you want to add some more weight."
    },
    {
        "title": "step-up",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Stand in front of a chair, bench or something else that you can step up on.",
            "Place your foot on the chair.",
            "Lightly brace your core, and step up until your leg is straight.",
            "Lower yourself in a controlled motion.",
            "You can keep your foot at the chair, and repeat for reps."
        ],
        "comments": "Step-ups have been shown to activate gluteus maximus even more than squats and hip thrusts do.1 It is a great exercise to do at home, since it is challenging even without weights. If you train at home, you can step up on whatever furniture you have at hand – a chair, a stair step or a bench, for example."
    },
    {
        "title": "ball-slams",
        "primary_muscles": [
            "Lats",
            "Abs",
            "Obliques"
        ],
        "secondary_muscles": [
            "Glutes",
            "Front Deltoids"
        ],
        "instructions": [
            "Stand with your feet about shoulder-width apart, your knees and hips slightly bent, holding the ball in both hands at chest height. Engage your core, and keep a good posture.",
            "Extend your knees and drive your hips forward while simultaneously lifting the ball. Aim for being as tall as possible, the ball overhead, arms up, hips slightly forward, and on your toes from the force of your drive.",
            "Use your core and arms to slam the medicine ball straight down between your feet with as much force as possible. Press your hips back and bend your knees to further power the slam. Exhale as you slam the ball down.",
            "Squat down to pick up the ball from the floor, then immediately move into the next slam by repeating the movement. Repeat for reps or time."
        ],
        "comments": "The ball slam is an excellent compound exercise that will work out a variety of muscles and raise your heart rate at the same time. As a bonus, you get to release some stress by slamming a ball as hard as possible into the ground."
    },
    {
        "title": "cable-crunch",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Fasten a rope handle in the upper position on a cable pulley. Sit down on your knees a few feet away, facing the pulley.",
            "Bend your upper body forward by contracting your abs. Hold the ropes on either side of your head throughout the movement.",
            "Reverse the motion and return to the starting position with control."
        ],
        "comments": "The cable crunch is an exercise where you have a little more control over the resistance compared to regular crunches, and also get a good range of motion."
    },
    {
        "title": "crunch",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Lie on your back, with your hands in front of your chest and your knees bent to about 90 degrees.",
            "Lift your upper body by contracting your abs and bending forward.",
            "Bend as far forward as possible while still keeping your low back in contact with the floor, and then return to the starting position."
        ],
        "comments": "The crunch is a classic body weight exercise for strengthening your abs. The exercise can be varied by lying on a soft training ball (i.e. pilates/bosu ball), and you can increase the load by holding a weight against your chest."
    },
    {
        "title": "dead-bugs",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Lie on your back, with your arms straight up towards the ceiling and your legs stacked over your hips, with the knees bent in a 90-degree angle.",
            "Engage your core, and make sure that the lower back has contact with the surface.",
            "With control, straighten out the right leg and lower it towards the floor at the same time as you lower the left arm over your head as far as you can. Keep the lower back in contact with the floor the entire time.",
            "Reverse the movement, and repeat for the other side."
        ],
        "comments": "The dead bug is a great core exercise that allows you to train your core without putting to much pressure on your lower back. As a bonus, you also get to practice your coordination skills."
    },
    {
        "title": "hanging-knee-raise",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Jump up and grab a bar, placed high enough that you can hang from it with straight legs.",
            "Without swinging and with bent legs, lift your knees as high as you can in front of you.",
            "Lower your legs again, with control."
        ],
        "comments": "Hanging knee raises train your abs and your hip flexors. The exercise can be made heavier by keeping your legs straight, which is called hanging leg raises."
    },
    {
        "title": "hanging-leg-raise",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Jump up and grab a bar, placed high enough that you can hang from it with straight legs.",
            "Without swinging, lift your legs as high as you can in front of you.",
            "Lower your legs again, with control."
        ],
        "comments": "Hanging leg raises train your abs and your hip flexors. The exercise can be made easier by bending your knees, called hanging knee raises, and you can make it heavier by using ankle weights or by holding a small dumbbell between your feet."
    },
    {
        "title": "hanging-sit-up",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Climb into position and lower your upper body down to the starting position, with your hands crossed over your chest.",
            "Lift your upper body upwards by contracting your abs.",
            "Reverse the motion and lower yourself down to the starting position again."
        ],
        "comments": "The hanging sit-up is a demanding ab exercise, and which might require some practice before you can get in and out of the rack in an easy way. The exercise can be made easier by reaching with your arms towards your feet, and heavier by extending your arms alongside your head or by holding a weight against your chest."
    },
    {
        "title": "high-to-low-wood-chop-with-band",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": [
            "Abs"
        ],
        "instructions": [
            "Fasten an elastic band high up. Grip the band with both hands, step away, and stand sideways to the band’s anchor point.",
            "With almost straight arms, make a sweeping, chopping-like movement diagonally downward.",
            "Return to the starting position in a controlled manner."
        ],
        "comments": "Banded wood chops from high to low is a good exercise for your oblique abdominal muscles, as it combines its rotating and flexing actions on the torso."
    },
    {
        "title": "horizontal-wood-chop-with-band",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Fasten an elastic band at shoulder height. Grip the band with both hands, step away, and stand sideways to the band’s anchor point.",
            "With almost straight arms, make a sweeping, horizontal movement to your other side.",
            "Return to the starting position in a controlled manner."
        ],
        "comments": "Horizontal wood chop trains the rotating function of your oblique abdominal muscles. To also train their flexing function, you can attach the band to a higher point, and perform the movement diagonally downwards."
    },
    {
        "title": "kneeling-ab-wheel-roll-out",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Sit with your knees on a soft pad, and place the ab wheel on the floor in front of you.",
            "Roll out as far as you can, and maintain a straight back throughout the movement.",
            "Reverse the movement with control, and return to the starting position."
        ],
        "comments": "This exercise can be performed either with an ab wheel or with a barbell that has good rotation. The exercise is easier when done on your knees, and harder when on your feet."
    },
    {
        "title": "www.strengthlog.com",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Stand on your elbows and knees.",
            "Brace your abs, and try to form and hold a straight line from your head to hips."
        ],
        "comments": "The kneeling plank is a bodyweight exercise to strengthen your abdominals. It is an easier version of the classic plank, in which you stand on your elbows and feet, and not your knees."
    },
    {
        "title": "kneeling-side-plank",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": [
            "Abs"
        ],
        "instructions": [
            "Stand on your side, leaning against one elbow and your knee.",
            "Brace your core and try to form and hold a straight line from your head to knees."
        ],
        "comments": "The kneeling side plank is a bodyweight exercise to strengthen your obliques. By kneeling, the exercise becomes easier than the regular side plank, in which you stand on your feet."
    },
    {
        "title": "lying-leg-raise",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Lie down with your back on the floor, and your arms at your sides.",
            "With straight legs, lift your legs until they are pointing straight up.",
            "Lower your legs again, with control."
        ],
        "comments": "Lying leg raises train your abs and your hip flexors. The exercise can be made easier by bending your knees slightly, and you can make it heavier by using ankle weights."
    },
    {
        "title": "lying-windshield-wiper",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": [
            "Abs"
        ],
        "instructions": [
            "Lie on your back, with your arms out to your sides and your legs straight up in the air.",
            "Slowly lower your legs down to one side.",
            "Reverse the motion, and lower your legs down to your other side."
        ],
        "comments": "Lying windshield wipers train your obliques. The exercise can be made easier by bending your knees, and heavier by using ankle weights."
    },
    {
        "title": "lying-windshield-wiper-with-bent-knees",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": [
            "Abs"
        ],
        "instructions": [
            "Lie on your back, with your arms out to your sides and your legs straight up in the air.",
            "Bend your knees to 90 degrees.",
            "Slowly lower your legs down to one side.",
            "Reverse the motion, and lower your legs down to your other side."
        ],
        "comments": "Lying windshield wipers train your obliques. The exercise is heavier when performed with straight legs."
    },
    {
        "title": "machine-crunch",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Adjust the machine to the appropriate settings, sit down, and grip the handles.",
            "Bend forward by contracting your abs.",
            "Reverse the motion and return to the starting position with control."
        ],
        "comments": "The machine crunch is an exercise where you have a little more control over the resistance compared to regular crunches, and also get a good range of motion."
    },
    {
        "title": "mountain-climbers",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Get into the plank position with your hands about shoulder-width apart, back flat, and core engaged.",
            "Pull your right knee into the chest as far as you can.",
            "Switch legs, pulling one knee out and bringing the other knee in.",
            "Keep your hips down and run the knees in and out as far and as fast as you can.",
            "Repeat for desired reps."
        ],
        "comments": "Mountain climbers are great for building core strength and agility, as well as some cardio endurance. You work several different muscle groups with mountain climbers—focusing on your core."
    },
    {
        "title": "oblique-crunch",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": [
            "Abs"
        ],
        "instructions": [
            "Lie on your back, with your hands on the side of your head and your knees bent to about 90 degrees.",
            "Contract your abs and lift your upper body diagonally, so that the elbow and shoulder on one side of your body move towards the knee on your other side.",
            "Bend as far as possible and then return to the starting position."
        ],
        "comments": "The oblique crunch is a classic bodyweight exercise for strengthening your internal and external obliques. The exercise can be varied by lying on a soft training ball (i.e. pilates/bosu ball), and you can increase the load by holding a weight against your chest."
    },
    {
        "title": "oblique-sit-up",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": [
            "Abs"
        ],
        "instructions": [
            "Lie on your back, with your hands behind your head, and your legs bent to about 90 degrees. Use a weight or something to stick your feet under, so they don’t lift from the ground.",
            "Lift your upper body diagonally by contracting your obliques and bending forward, until your right elbow touches your left leg, or vice versa.",
            "Return to the starting position."
        ],
        "comments": "The sit-up is a classic body weight exercise for strengthening your abs. This is a variant of the sit-up that targets the obliques."
    },
    {
        "title": "plank",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Stand on your elbows and feet.",
            "Brace your abs and try to form and hold a straight line from your head to feet."
        ],
        "comments": "The plank is a bodyweight exercise to strengthen your abdominals. The exercise can be made more challenging by placing your hands or feet on an unstable surface (such as a Bosu ball, balance board, or in suspended rings), or by placing a weight on your back."
    },
    {
        "title": "plank-with-leg-lifts",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Begin by getting into a standard plank position. Place your elbows directly under your shoulders, legs extended straight behind you, and toes pressing into the ground. Your body should form a straight line from your head to your heels.",
            "Brace your core, keep your back flat, and avoid letting your hips sink down or lift too high.",
            "Slowly lift one leg off the ground to about hip height without bending the knee. Keep your leg straight during the movement.",
            "Hold the lifted position for a moment, then gently lower your leg back to the starting position.",
            "Repeat the lift with the opposite leg, ensuring you maintain a strong plank position throughout the movement.",
            "Continue to alternate legs for the chosen amount of time."
        ],
        "comments": "Plank leg raises are excellent for strengthening your core while also challenging your balance and stability. Remember to breathe evenly throughout the exercise. Focus on maintaining a solid plank form throughout the exercise. Avoid rocking your hips or twisting your body as you lift your legs."
    },
    {
        "title": "side-plank",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": [
            "Abs"
        ],
        "instructions": [
            "Stand on your side, leaning against one elbow.",
            "Place the foot of the top leg in front of the other foot.",
            "Brace your core, and try to form and hold a straight line from your head to your feet."
        ],
        "comments": "The side plank is a bodyweight exercise to strengthen your obliques. The exercise can be made more challenging by placing your elbow or feet on an unstable surface (such as a Bosu ball, balance board, or suspended rings)."
    },
    {
        "title": "sit-up",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Lie on your back, with your hands in front of your chest and your knees bent to about 90 degrees. Use a weight or something to stick your feet under, so they don’t lift from the ground.",
            "Lift your upper body by contracting your abs and bending forward.",
            "Bend as far forward as possible, and then return to the starting position."
        ],
        "comments": "The sit-up is a classic body weight exercise for strengthening your abs. You can increase the load by holding a weight against your chest."
    },
    {
        "title": "barbell-standing-calf-raise",
        "primary_muscles": [
            "Calves"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Place a barbell on your shoulders, and stand with your toes and the ball of your feet on a step, like a weight plate or something similar. Stand upright in the starting position.",
            "Lower yourself down by bending your ankles in a controlled movement.",
            "Push yourself up by extending your ankles."
        ],
        "comments": "Standing calf raises train both the inner (solues) and outer (gastrocnemius) calf muscles simultaneously."
    },
    {
        "title": "eccentric-heel-drop",
        "primary_muscles": [
            "Calves"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand on a stable elevation, like a stair step or a thick weight plate. Hold on to something for balance.",
            "Raise your heels and extend your feet by using both your legs.",
            "Lift one leg, and lower yourself with control standing on only one foot."
        ],
        "comments": "The eccentric heel drop is an exercise in which you can overload your calf muscles in the eccentric phase. This is done by using two legs in the concentric phase, but only one in the eccentric phase."
    },
    {
        "title": "heel-raise",
        "primary_muscles": [
            "Calves"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand on a solid surface, or an elevation for increased range of motion. Hold on to something for balance.",
            "Raise your heels by using your calves.",
            "Lower yourself with control, and repeat for reps."
        ],
        "comments": "The heel raise is a classic calf exercise, which in its base form doesn’t require any equipment. If you want to make the exercise heavier, you can hold something heavy in your free hand, such as a dumbbell. An alternative is to use both your legs on the way up, but lower yourself down using only one leg."
    },
    {
        "title": "seated-calf-raise",
        "primary_muscles": [
            "Calves"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Sit down on the seat, and adjust the knee pad to correct height. Place your toes and the ball of your feet on the foot support.",
            "Lower the weight by bending your ankles in a controlled movement.",
            "Push the weight up by extending your ankles."
        ],
        "comments": "Seated calf raises mostly train the inner calf muscle (solues), because the outer calf muscle (gastrocnemius) is in a shortened position."
    },
    {
        "title": "standing-calf-raise",
        "primary_muscles": [
            "Calves"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Place your toes and the ball of your feet on the foot support. Place the shoulder pads against your shoulders and stand upright in the starting position.",
            "Lower yourself down by bending your ankles in a controlled movement.",
            "Push yourself up by extending your ankles."
        ],
        "comments": "Standing calf raises train both the inner (solues) and outer (gastrocnemius) calf muscles simultaneously."
    },
    {
        "title": "barbell-wrist-curl",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a barbell with an underhand grip and rest your forearms against your thighs, or alternatively against a bench.",
            "Lower your hands towards the floor, and let the barbell roll out in your fingers.",
            "Reverse the motion by closing your grip and bending your wrists upwards."
        ],
        "comments": "Barbell wrist curls train the muscles in the forearm that flexes (bends) the wrist and closes your hand. As an alternative, you can perform the exercise with a dumbbell, or rest your forearms against a bench instead of your legs."
    },
    {
        "title": "barbell-wrist-curl-behind-the-back",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a barbell behind your back and let it hang in your arms.",
            "Open your hands and let the barbell roll out in your fingers.",
            "Reverse the motion by closing your grip and bending your wrists upwards."
        ],
        "comments": "Barbell wrist curls behind your back train the muscles in the forearm that flexes (bends) the wrist and closes your hand."
    },
    {
        "title": "bar-hang",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a bar and hang from it.",
            "Experiment with hanging with relaxed or active shoulders."
        ],
        "comments": "Hanging from a bar train your grip strength and your shoulders. It is an exercise that can improve your shoulder mobility for holding your arms above your head."
    },
    {
        "title": "dumbbell-wrist-curl",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a dumbbell with an underhand grip and rest your forearm against your thigh, or alternatively against a bench.",
            "Lower your hand towards the floor, and let the dumbbell roll out in your fingers.",
            "Reverse the motion by closing your grip and bending your wrist upwards."
        ],
        "comments": "Dumbbell wrist curls train the muscles in the forearm that flexes (bends) the wrist and closes your hand. As an alternative, you can perform the exercise with a barbell, or rest your forearm against a bench instead of your legs."
    },
    {
        "title": "farmers-walk",
        "primary_muscles": [
            "Forearm Flexors",
            "Obliques",
            "Glutes",
            "Trapezius"
        ],
        "secondary_muscles": [
            "Quads",
            "Abs",
            "Lower Back",
            "Calves",
            "Lateral Deltoids"
        ],
        "instructions": [
            "Step in between two farmers walk-cases, or similar implements.",
            "Inhale, lean forward and grip the handles.",
            "Hold your breath, brace your core slightly, and lift the weights.",
            "Look ahead, and start moving forward in small steps. Increase the stride length as you increase the speed.",
            "Try to keep your body in a straight line and not lean excessively forward as you walk.",
            "When you are done, lower the implements back to the ground in a controlled manner."
        ],
        "comments": "Farmers walk is an exercise that, in short, trains you to carry heavy things. The exercise may look simple, but actually trains large parts of your body, with a special focus on grip, shoulders, and stability in your core and hips."
    },
    {
        "title": "fat-bar-deadlift",
        "primary_muscles": [
            "Glutes",
            "Forearm Flexors",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Hamstrings",
            "Adductors",
            "Trapezius"
        ],
        "instructions": [
            "Step up close to the bar, so that it is about over the middle of your foot.",
            "Breathe in, lean forward and grip the bar.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Pull the bar close to your body, with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": "The deadlift is a classic exercise that trains almost your entire body, and a competitive event in the sport of powerlifting. This exercise requires great core stability and control, and you should strive to keep your spine straight (neutral) during the entire lift."
    },
    {
        "title": "gripper",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a gripper, and hold it so that it is as open as possible without slipping out of your hand.",
            "Close the gripper all the way by closing your hand.",
            "Return to the starting position and repeat."
        ],
        "comments": "A gripper trains the muscles in your hand and forearm that close your grip. This kind of grip strength is often called a crushing grip, in contrast to static or pinching grip strength."
    },
    {
        "title": "one-handed-bar-hang",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a bar with one hand, and hang from it.",
            "Start off by hanging with a tensed and active shoulder, and then gradually experiment with hanging with a more relaxed shoulder."
        ],
        "comments": "Hanging from a bar train your grip strength and your shoulders, and hanging in one hand is a good measure of strength. It is an exercise that can improve your shoulder mobility for holding your arms above your head."
    },
    {
        "title": "plate-pinch",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a pair of weight plates in a pinching grip.",
            "Lift the weight plates off the ground.",
            "Hold them for as long as you can, and then put them down in a controlled manner."
        ],
        "comments": "The plate pinch trains the muscles in your forearm and hand that perform a pinching grip. The design of the weight plates and whether you use magnesium or not will have a big impact on how much weight you can lift in this exercise."
    },
    {
        "title": "plate-wrist-curl",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a weight plate with a pinching underhand grip and rest your forearm against your thigh, or alternatively against a bench.",
            "Lower your hand towards the floor.",
            "Reverse the motion by bending your wrist upwards."
        ],
        "comments": "Plate wrist curls train the muscles in the forearm that flexes (bends) your wrist and the muscles in your hand that makes a pinching grip. As an alternative, you can rest your forearm against a bench instead of your legs."
    },
    {
        "title": "towel-pull-up",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Lay a pair of towels over a pull-up bar. Grab one in each hand.",
            "Inhale and pull yourself up as high as you can.",
            "Exhale and lower yourself with control until your arms are fully extended."
        ],
        "comments": "The towel pull-up is a variant of the regular pull-up, which places extra high demands on your grip. In addition to training your back muscles and elbow flexors, the grip muscles in your forearms and hands will also get trained hard. An alternative to using two towels is to instead just put one long towel over the bar and grab it at each end. That will lead to a more narrow grip."
    },
    {
        "title": "wrist-roller",
        "primary_muscles": [
            "Forearm Flexors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand with your feet shoulder-width apart, holding the wrist roller bar with both hands, arms fully extended in front of you.",
            "Attach a weight to the rope or cord hanging from the wrist roller.",
            "Begin the exercise by rolling the bar forward using your wrists, lifting the weight from the ground by winding the rope around the bar.",
            "Once the weight reaches the top, slowly reverse the motion, unwinding the rope and lowering the weight back to the ground.",
            "Repeat for the desired number of repetitions."
        ],
        "comments": "The Wrist Roller is a good exercise for building grip strength, forearm endurance, and wrist stability. It’s often used to improve performance in activities requiring strong grip and forearm strength."
    },
    {
        "title": "barbell-wrist-extension",
        "primary_muscles": [
            "Forearm Extensors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a barbell with an overhand grip and rest your forearms against your thighs, or alternatively against a bench.",
            "Lower your hands towards the floor.",
            "Reverse the motion by bending your wrists upwards."
        ],
        "comments": "Barbell wrist extension trains the muscles in the forearm that extends your wrist. As an alternative, you can perform the exercise with a dumbbell, or rest your forearms against a bench instead of your legs."
    },
    {
        "title": "dumbbell-wrist-extension",
        "primary_muscles": [
            "Forearm Extensors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grab a dumbbell with an overhand grip and rest your forearm against your thigh, or alternatively against a bench.",
            "Lower your hand towards the floor.",
            "Reverse the motion by bending your wrist upwards."
        ],
        "comments": "Dumbbell wrist extension trains the muscles in the forearm that extends your wrist. As an alternative, you can perform the exercise with a barbell, or rest your forearm against a bench instead of your leg."
    },
    {
        "title": "rowing-machine",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Catch",
            "Drive",
            "Finish",
            "Recovery"
        ],
        "comments": ""
    },
    {
        "title": "stationary-bike",
        "primary_muscles": "",
        "secondary_muscles": "",
        "instructions": [
            "Rectus femoris",
            "Vastus medius",
            "Vastus intermedius",
            "Vastus lateralis muscles"
        ],
        "comments": ""
    },
    {
        "title": "bench-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Lie on the bench, pull your shoulder blades together and down, and slightly arch your back.",
            "Grip the bar slightly wider than shoulder-width apart.",
            "Inhale, hold your breath, and unrack the bar.",
            "Lower the bar with control, until it touches your chest somewhere close to your sternum.",
            "Push the bar up to the starting position while exhaling.",
            "Take another breath while in the top position, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-incline-press",
        "primary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps"
        ],
        "instructions": [
            "Adjust the incline of a bench to be around 30-45 degrees.",
            "Sit down and lift a pair of dumbbells to the starting position.",
            "Press the dumbbells up to straight arms while exhaling.",
            "Inhale at the top or while lowering the dumbbells with control back to your shoulders."
        ],
        "comments": ""
    },
    {
        "title": "bar-dip",
        "primary_muscles": [
            "Chest",
            "Front Deltoid",
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Grip a dip station about shoulder-width apart, and climb or jump to get into the starting position.",
            "Lower yourself with control until your shoulder is below your elbow, or as deep as you comfortably can.",
            "Reverse the motion and return to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "standing-cable-chest-fly",
        "primary_muscles": [
            "Chest"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Fasten a pair of handles in the top position of a cable cross. Grip the handles, step forward, and lean slightly forward.",
            "With just a slight bend in the arms, push the handles forward until they meet in front of your body.",
            "With control, let the handles go back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "overhead-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "First, place a barbell in a rack at about chest height.",
            "Grip the bar slightly wider than shoulder-width apart, and step close to it.",
            "Inhale, lightly brace your core, and unrack the bar.",
            "Let the bar rest against your front delts while you step back from the rack.",
            "Press the bar up to straight arms while exhaling.",
            "Inhale at the top or while lowering the bar with control back to your shoulders.",
            "Repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "seated-dumbbell-shoulder-press",
        "primary_muscles": [
            "Front Deltoid"
        ],
        "secondary_muscles": [
            "Triceps",
            "Lateral Deltoid"
        ],
        "instructions": [
            "Sit down on a bench with a raised backrest.",
            "Grab a pair of dumbbells and lift them up to the starting position at your shoulders.",
            "Inhale and lightly brace your core.",
            "Press the dumbbells up to straight arms while exhaling.",
            "Inhale at the top or while lowering the dumbbells with control back to your shoulders.",
            "Repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-lateral-raise",
        "primary_muscles": [
            "Lateral Deltoid"
        ],
        "secondary_muscles": [
            "Front Deltoid"
        ],
        "instructions": [
            "Hold a pair of dumbbells in almost straight arms hanging by your sides.",
            "With control, lift the dumbbells out to your sides until your upper arms are horizontal.",
            "Lower the dumbbells with control.",
            "Repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "reverse-dumbbell-flyes",
        "primary_muscles": [
            "Rear Deltoid",
            "Rotator Cuff"
        ],
        "secondary_muscles": [
            "Trapezius"
        ],
        "instructions": [
            "Hold a pair of dumbbells, lean forward, and let your arms hang towards the floor.",
            "With almost straight arms (just a slight bend at the elbow), slowly lift the dumbbells by raising your arms out to the sides.",
            "Reverse the movement and lower the dumbbells back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Quads",
            "Hamstrings",
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Step up close to the bar so that it is about over the middle of your foot.",
            "Inhale, lean forward, and grip the bar.",
            "Hold your breath, brace your core slightly, and lift the bar.",
            "Pull the bar close to your body, with a straight back, until you are standing straight.",
            "Lower the bar back to the ground with control.",
            "Take another breath, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "lat-pulldown-with-pronated-grip",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Begin by adjusting the thigh pad to fit snugly against your thighs to prevent your body from lifting off the seat.",
            "Grasp the bar with an overhand (pronated) grip, with your hands slightly wider than shoulder-width apart.",
            "Sit with your thighs under the thigh pad, keep your chest up, and look at the bar.",
            "Pull the bar down towards your chest, leading with your elbows.  Pull until the bar is below your chin or touches your upper chest.",
            "Squeeze your shoulder blades together at the bottom of the movement.",
            "Exhale and slowly release the bar back up to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "pull-up",
        "primary_muscles": [
            "Lats"
        ],
        "secondary_muscles": [
            "Biceps",
            "Rear Deltoids",
            "Forearm Flexors",
            "Rotator Cuffs"
        ],
        "instructions": [
            "Grip the bar with palms facing away from you, slightly wider than shoulder-width.",
            "Keep your chest up, and look up at the bar.",
            "Inhale and pull yourself up until your chin is over the bar or the bar touches your upper chest.",
            "Exhale and lower yourself with control until your arms are fully extended."
        ],
        "comments": "Pull-ups train both your lats and arm flexors effectively. By using a grip slightly wider than shoulder-width, you get a good range of motion and high muscle activation in all the working muscles."
    },
    {
        "title": "barbell-row",
        "primary_muscles": [
            "Lats",
            "Trapezius",
            "Rear Deltoids"
        ],
        "secondary_muscles": [
            "Biceps",
            "Lower Back",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Grip the bar with an overhand grip.",
            "Lean forward with the bar hanging from straight arms.",
            "Inhale and pull the bar towards you.",
            "Pull the bar as high as you can so that it touches your abs or chest, if possible.",
            "With control, lower the bar back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-row",
        "primary_muscles": "",
        "secondary_muscles": [
            "Biceps",
            "Forearm Flexors",
            "Rotator Cuff"
        ],
        "instructions": [
            "Start by placing a dumbbell on the floor beside a bench or chair. Stand facing the bench or chair and place your left hand and left knee on top of it.",
            "Keep your back flat and parallel to the ground, with a slight bend in the standing leg. Grip the dumbbell with your right hand.",
            "Inhale and pull the dumbbell by driving the elbow toward the ceiling.",
            "With control, lower the dumbbell back to the starting position while exhaling.",
            "Complete desired reps on one side, then switch to the opposite arm and leg."
        ],
        "comments": ""
    },
    {
        "title": "barbell-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Grip a bar with an underhand (supinated) grip, hands about shoulder-width apart.",
            "Lift the bar with control, by flexing your elbows.",
            "Don’t let your upper arm travel back during the curl, keep it at your side or move it slightly forward.",
            "Reverse the movement and lower the bar back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "dumbbell-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Hold a pair of dumbbells in an underhand (supinated) grip, arms hanging by your sides.",
            "Lift the dumbbells with control, by flexing your elbows.",
            "Don’t let your upper arms travel back during the curl. Keep them at your sides, or move them slightly forward.",
            "Reverse the movement and lower the dumbbells back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "hammer-curl",
        "primary_muscles": [
            "Biceps"
        ],
        "secondary_muscles": [
            "Forearm Flexors"
        ],
        "instructions": [
            "Hold a pair of dumbbells in a neutral grip (palms facing each other), arms hanging by your sides.",
            "Lift the dumbbells with control by flexing your elbows.",
            "Don’t let your upper arms travel back during the curl. Keep them at your sides, or move them slightly forward.",
            "Reverse the movement and lower the dumbbells back to the starting position."
        ],
        "comments": ""
    },
    {
        "title": "barbell-lying-triceps-extension",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Lie down on a bench with your head close to the edge. Hold a barbell with a shoulder-wide grip, and lift it up to straight arms over yourself.",
            "Lower the barbell down behind your head. Try to keep the same distance between your elbows throughout the movement.",
            "Reverse the motion and extend your arms again."
        ],
        "comments": ""
    },
    {
        "title": "overhead-cable-triceps-extension",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Fasten a rope handle in the lower position of a cable pulley. Stand with your back against the pulley, with a slight forward lean, and hold the rope behind your head and your upper arms next to your ears.",
            "Straighten your elbows until your arms are fully extended.",
            "Reverse the motion by bending your arms again."
        ],
        "comments": ""
    },
    {
        "title": "tricep-pushdown-with-bar",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand one step away from the cable pulley, and grip a bar about shoulder-width apart.",
            "Pull the handle down until your upper arms are perpendicular to the floor. This is the starting position.",
            "Push the handle down until your arms are fully extended.",
            "With control, let the handle up again."
        ],
        "comments": ""
    },
    {
        "title": "close-grip-bench-press",
        "primary_muscles": [
            "Triceps"
        ],
        "secondary_muscles": [
            "Chest",
            "Front Deltoid"
        ],
        "instructions": [
            "Lie on the bench, pull your shoulder blades together and down, and slightly arch your back.",
            "Grip the bar narrower than in a regular bench press so that your hands are directly above your shoulders or even closer.",
            "Take a breath and hold it, and unrack the bar.",
            "Lower the bar with control until it touches your chest somewhere where the ribs end.",
            "Push the bar up to the starting position while exhaling.",
            "Take another breath in the top position, and repeat for reps."
        ],
        "comments": "The close-grip bench press is a variant of the bench press where you transfer more of the work to the triceps, and away from the chest and front deltoid. This means that most people will have to use less weight in the close-grip bench press than in the regular bench press."
    },
    {
        "title": "squat",
        "primary_muscles": [
            "Quads",
            "Adductors",
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Place the bar on your upper back. Inhale and brace your core slightly, and unrack the bar.",
            "Take two steps back, and adjust your foot position.",
            "Squat as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again.",
            "Exhale on the way up or exchange air in the top position.",
            "Inhale and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "hack-squat-machine",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine to the correct height and place your shoulders against the shoulder pads.",
            "Put your feet on the plate, slightly in front of the base of the sled and about shoulder width apart.",
            "Extend your legs and disengage the sled’s locks.",
            "Inhale, brace your core lightly, and squat down as deep as you can with good form.",
            "Reverse the movement with control, and extend your legs again until you’re back in the starting position. Exhale on the way up."
        ],
        "comments": ""
    },
    {
        "title": "leg-extension",
        "primary_muscles": [
            "Quads"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine so that you are correctly positioned. Your knees should be in line with the machine’s joint.",
            "Extend your knees with control, until they are completely straight.",
            "Slowly lower the weight again."
        ],
        "comments": ""
    },
    {
        "title": "bulgarian-split-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand with your back turned against a bench, which should be at about knee height. Stand about one long step in front of the bench.",
            "Place one foot on the bench behind you.",
            "Inhale, look forward, and squat down with control until right before the knee of the back leg touches the floor.",
            "Reverse the movement and extend your front leg again, while exhaling.",
            "Inhale at the top and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "seated-leg-curl",
        "primary_muscles": [
            "Hamstrings"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine so that you are correctly positioned. Your knees should be in line with the machine’s joint.",
            "Push the weight down by bending your knees as far as possible.",
            "Slowly let the weight back again."
        ],
        "comments": ""
    },
    {
        "title": "lying-leg-curl",
        "primary_muscles": [
            "Hamstrings"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Adjust the machine so that you are correctly positioned. Your knees should be in line with the machine’s joint.",
            "Lift the weight by bending your knees as far as possible.",
            "Slowly lower the weight again."
        ],
        "comments": "The lying leg curl is an isolation exercise where it is easy to focus on the hamstrings."
    },
    {
        "title": "romanian-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Get into the starting position by deadlifting a barbell off the floor, or by unracking it from a barbell rack.",
            "Inhale, brace your core slightly, and lean forward by hinging in your hips. Keep your knees almost completely extended.",
            "Lean forward as far as possible without rounding your back. You don’t have to touch the barbell to the floor, although it is OK if you do.",
            "Reverse the movement and return to the starting position. Exhale on the way up.",
            "Take another breath, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "squat",
        "primary_muscles": [
            "Quads",
            "Adductors",
            "Glutes",
            "Lower Back"
        ],
        "secondary_muscles": [
            "Calves"
        ],
        "instructions": [
            "Place the bar on your upper back. Inhale and brace your core slightly, and unrack the bar.",
            "Take two steps back, and adjust your foot position.",
            "Squat as deep as possible with good technique.",
            "With control, stop and reverse the movement, extending your hips and legs again.",
            "Exhale on the way up or exchange air in the top position.",
            "Inhale and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "hip-thrust",
        "primary_muscles": [
            "Glutes"
        ],
        "secondary_muscles": [
            "Adductors",
            "Quads"
        ],
        "instructions": [
            "Sit on the floor with your back against a sturdy bench.",
            "Roll the barbell up over your thighs, until it is placed over your hips.",
            "Place your feet on the floor, about shoulder-width apart, with bent knees.",
            "Place your hands on the bar to stabilize it.",
            "Push the bar towards the ceiling by extending your hips. Your knees should form a ~90 degree angle at the top.",
            "Lower the weight and repeat for reps."
        ],
        "comments": "The hip thrust is an isolation exercise for your hip extensors, particularly your glutes. The exercise can be varied by using either one or two legs, by elevating your feet for a longer range of motion, or by adding an elastic band between your knees to train your hip abductors simultaneously."
    },
    {
        "title": "romanian-deadlift",
        "primary_muscles": [
            "Glutes",
            "Lower Back",
            "Hamstrings"
        ],
        "secondary_muscles": [
            "Adductors",
            "Trapezius",
            "Forearm Flexors"
        ],
        "instructions": [
            "Get into the starting position by deadlifting a barbell off the floor, or by unracking it from a barbell rack.",
            "Inhale, brace your core slightly, and lean forward by hinging in your hips. Keep your knees almost completely extended.",
            "Lean forward as far as possible without rounding your back. You don’t have to touch the barbell to the floor, although it is OK if you do.",
            "Reverse the movement and return to the starting position. Exhale on the way up.",
            "Take another breath, and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "bulgarian-split-squat",
        "primary_muscles": [
            "Quads",
            "Glutes",
            "Adductors"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Stand with your back turned against a bench, which should be at about knee height. Stand about one long step in front of the bench.",
            "Place one foot on the bench behind you.",
            "Inhale, look forward, and squat down with control until right before the knee of the back leg touches the floor.",
            "Reverse the movement and extend your front leg again, while exhaling.",
            "Inhale at the top and repeat for reps."
        ],
        "comments": ""
    },
    {
        "title": "cable-crunch",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Fasten a rope handle in the upper position on a cable pulley. Sit down on your knees a few feet away, facing the pulley.",
            "Bend your upper body forward by contracting your abs. Hold the ropes on either side of your head throughout the movement.",
            "Reverse the motion and return to the starting position with control."
        ],
        "comments": "The cable crunch is an exercise where you have a little more control over the resistance compared to regular crunches, and also get a good range of motion."
    },
    {
        "title": "hanging-leg-raise",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Jump up and grab a bar, placed high enough that you can hang from it with straight legs.",
            "Without swinging, lift your legs as high as you can in front of you.",
            "Lower your legs again, with control."
        ],
        "comments": "Hanging leg raises train your abs and your hip flexors. The exercise can be made easier by bending your knees, called hanging knee raises, and you can make it heavier by using ankle weights or by holding a small dumbbell between your feet."
    },
    {
        "title": "high-to-low-wood-chop-with-band",
        "primary_muscles": [
            "Obliques"
        ],
        "secondary_muscles": [
            "Abs"
        ],
        "instructions": [
            "Fasten an elastic band high up. Grip the band with both hands, step away, and stand sideways to the band’s anchor point.",
            "With almost straight arms, make a sweeping, chopping-like movement diagonally downward.",
            "Return to the starting position in a controlled manner."
        ],
        "comments": "Banded wood chops from high to low is a good exercise for your oblique abdominal muscles, as it combines its rotating and flexing actions on the torso."
    },
    {
        "title": "crunch",
        "primary_muscles": [
            "Abs"
        ],
        "secondary_muscles": [
            "Obliques"
        ],
        "instructions": [
            "Lie on your back, with your hands in front of your chest and your knees bent to about 90 degrees.",
            "Lift your upper body by contracting your abs and bending forward.",
            "Bend as far forward as possible while still keeping your low back in contact with the floor, and then return to the starting position."
        ],
        "comments": "The crunch is a classic body weight exercise for strengthening your abs. The exercise can be varied by lying on a soft training ball (i.e. pilates/bosu ball), and you can increase the load by holding a weight against your chest."
    },
    {
        "title": "standing-calf-raise",
        "primary_muscles": [
            "Calves"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Place your toes and the ball of your feet on the foot support. Place the shoulder pads against your shoulders and stand upright in the starting position.",
            "Lower yourself down by bending your ankles in a controlled movement.",
            "Push yourself up by extending your ankles."
        ],
        "comments": "Standing calf raises train both the inner (solues) and outer (gastrocnemius) calf muscles simultaneously."
    },
    {
        "title": "seated-calf-raise",
        "primary_muscles": [
            "Calves"
        ],
        "secondary_muscles": "",
        "instructions": [
            "Sit down on the seat, and adjust the knee pad to correct height. Place your toes and the ball of your feet on the foot support.",
            "Lower the weight by bending your ankles in a controlled movement.",
            "Push the weight up by extending your ankles."
        ],
        "comments": "Seated calf raises mostly train the inner calf muscle (solues), because the outer calf muscle (gastrocnemius) is in a shortened position."
    }
]